[
    {
        "name": "Sampath perera",
        "review_date": "Today",
        "title": "Golden dragon",
        "review": "I prefer this restaurant as best chinese in colombo,foods are so delicious..,prawn dimsum is our favorite olso we like black pepa sauce with any meat.olso allways they have good service team kasun and lasantha specially mention.thanks .."
    },
    {
        "name": "Geethika S",
        "review_date": "Jul 2021",
        "title": "Excellent service",
        "review": "As usuall lasantha and kasun did excellent job.golden dragon team allways frindly with us we olso now reguler customer because of allways they given us to professional and frindly service. Everyday we had delicious food from chef chinthana, chef saman and the team. Highly recomonded for chinese."
    },
    {
        "name": "Lakshman",
        "review_date": "Jul 2021",
        "title": "Excellent service and delicious foods",
        "review": "Me and my frinds visited to taj samudra colombo last week.we decided to have our dinner at golden dragon restaurant.danushka welcome and seated us.entire our dinner time lasantha and kasun gave us maximum support with a excellent fb service.we ordered egg fried rice,kungpao chicken,crispy lamb,mix veg.food was so delicious.everything was perfect.👍"
    },
    {
        "name": "Deshani C",
        "review_date": "Jul 2021",
        "title": "Simply awesome dinning experience",
        "review": "Actually that was our first visit to golden dragon restaurant in taj samudra colombo .we really enjoyed food and the service .lasantha adviced us in selecting the menu and the correct portion sizes .jesmine green tea is very refresh .olso calm ambiance at the restaurant .awesome experience .we will back agin . Thanks for everything"
    },
    {
        "name": "Madarap W",
        "review_date": "Jul 2021",
        "title": "Dinner at golden dragon",
        "review": "We had a wonderful dinner at gd last friday,it was great as usul,very tasty food seefood spicy fried rice,blk pepa chicken,greens with white garlic,crispy lamb.,and olso excelent service provide by lasantha,safe enverment with calm pipe music..,such great dinning experiance."
    },
    {
        "name": "Sampath perera",
        "review_date": "Today",
        "title": "Golden dragon",
        "review": "I prefer this restaurant as best chinese in colombo,foods are so delicious..,prawn dimsum is our favorite olso we like black pepa sauce with any meat.olso allways they have good service team kasun and lasantha specially mention.thanks .."
    },
    {
        "name": "Geethika S",
        "review_date": "Jul 2021",
        "title": "Excellent service",
        "review": "As usuall lasantha and kasun did excellent job.golden dragon team allways frindly with us we olso now reguler customer because of allways they given us to professional and frindly service. Everyday we had delicious food from chef chinthana, chef saman and the team. Highly recomonded for chinese."
    },
    {
        "name": "Lakshman",
        "review_date": "Jul 2021",
        "title": "Excellent service and delicious foods",
        "review": "Me and my frinds visited to taj samudra colombo last week.we decided to have our dinner at golden dragon restaurant.danushka welcome and seated us.entire our dinner time lasantha and kasun gave us maximum support with a excellent fb service.we ordered egg fried rice,kungpao chicken,crispy lamb,mix veg.food was so delicious.everything was perfect.👍"
    },
    {
        "name": "Deshani C",
        "review_date": "Jul 2021",
        "title": "Simply awesome dinning experience",
        "review": "Actually that was our first visit to golden dragon restaurant in taj samudra colombo .we really enjoyed food and the service .lasantha adviced us in selecting the menu and the correct portion sizes .jesmine green tea is very refresh .olso calm ambiance at the restaurant .awesome experience .we will back agin . Thanks for everything"
    },
    {
        "name": "Madarap W",
        "review_date": "Jul 2021",
        "title": "Dinner at golden dragon",
        "review": "We had a wonderful dinner at gd last friday,it was great as usul,very tasty food seefood spicy fried rice,blk pepa chicken,greens with white garlic,crispy lamb.,and olso excelent service provide by lasantha,safe enverment with calm pipe music..,such great dinning experiance."
    },
    {
        "name": "Raj G",
        "review_date": "Jun 2021",
        "title": "good",
        "review": "Not very happy about the room shifting after few days to a smaller room.. Otherwise , room hygiene was satisfactory..Food was satisfactory.. Sea view was best ..Room was small , but good Location is good"
    },
    {
        "name": "Imesh F",
        "review_date": "Jun 2021",
        "title": "Honeymoon stay",
        "review": "We had a honeymoon stay at Taj Samudra, Colombo. It was one of the best stays that we’ve had. The staff at Port’s of call restaurant were very helpful and friendly. Special thanks to Dilhara, Warren, Ravindu, Charitha and Madhu for the service provided and organizing the surprise birthday cake. The food was delicious."
    },
    {
        "name": "Elliot",
        "review_date": "May 2021",
        "title": "Excellent stay at Taj Samudra",
        "review": "Great location with a great view no matter what room you have. Excellent amenities and overall great staff and service. Shashika & her Housekeeping team were amazing and always responsive to anything I needed. The location is very close to many places and plenty to do and see. will definitely return my next time in Colombo"
    },
    {
        "name": "Niluni Perera",
        "review_date": "May 2021",
        "title": "Supereb",
        "review": "Nice hotel . Very good service. From the check in until the check out every thing is perfect. Maintain the standard as it is. Reception is perfect. All the covid privantion methods strictly follow. We will meet up"
    },
    {
        "name": "gayathries2014",
        "review_date": "May 2021",
        "title": "Function at taj",
        "review": "We had a fiction at taj last month and the support We got was amazing. Special thanks to Dinusha chef shamila and Onella. The food was amazing and the service was unexplainable. I would recommend taj for all my friends in the future. Also I stayed one night at the hotel during February. The rooms were amazing with a spectacular ocean view. Keep up the great work guys. All the best. And thank u again"
    },
    {
        "name": "Geethika J",
        "review_date": "May 2021",
        "title": "Honeymoon at Taj Samudra",
        "review": "We stayed at Taj Samudra for our honeymoon for two days and it was a great experience. Check in procedure and the cleanliness of the room was excellent. They always served us the highest quality foods. The Ports of Call staff did their best when serving the foods. All of the staff members were following the safety measures during this pandemic period. They provided almost all of our requirements during our stay. We would specially like to thank Ms. Shashika Amarasinghe and her team on the 6th floor for their excellent service."
    },
    {
        "name": "Rükshàñ J",
        "review_date": "May 2021",
        "title": "Supportive staff",
        "review": "We had our wedding at this Beautiful hotel and it was truly a day to remember and we stayed the night and had an amazing breakfast. The staff member who was at the Reception, i think his name was Asanka helped us in every issue we had. No matter what kind of issue you have the staff is always ready to provide a solution. It was hassle free for me and my wife. Thanks Taj Samudra for the amazing customer service."
    },
    {
        "name": "Nishika R",
        "review_date": "May 2021",
        "title": "Dinner buffet",
        "review": "Dinner at PORTS OF CALL Restaurant at taj, the food was out of this world. Rana, Waran, Chathura, Dilhara and Theekshana were a great sport at the floor. We were simply amazed by their personal effort to serve us the best experience ever!! Hope to visit this place soon"
    },
    {
        "name": "Daham R",
        "review_date": "Apr 2021",
        "title": "Dinner buffet",
        "review": "Good food and excellent service Keep it up .wel done.good package.woooowwww entrance and we had a good Dinner today with my friends the service is excellent and staff support also excellent and staff member dilhara gave us a good service on selecting food Thank you so much Taj samudra"
    },
    {
        "name": "Huda S",
        "review_date": "Apr 2021",
        "title": "Dinner buffet",
        "review": "The staff and hospitality is what I love here The food is very nice The restaurant I visited was Ports of call restaurant Team Dilhara Jagath Athauda Amila Mr charity We’re so kind to host us and serve . Will come back"
    },
    {
        "name": "NishiLi",
        "review_date": "Apr 2021",
        "title": "Dinner Buffet",
        "review": "Ports of Call Restaurant is a great place for celebrations!! Went there for a birthday celebration and the staff were so friendly and welcoming. Pleasant and very attentive to our needs. Excellent service provided by the team especially by Dilhara, Sampath, Wasala, Dias, Bandara, Chaminda and Warren. Thank you very much."
    },
    {
        "name": "Jeffrey Bahar",
        "review_date": "Apr 2021",
        "title": "Ports Of Call",
        "review": "The Food was @ 90% Flavour, Taste, Quality rated this at this level for the soups, salads, indian dishes the prawn buriyani oh my goodness by the great indian chef from which city I cannot remember because all the food and flavours were too good, thank you to you too, the main men and women to perfect the already perfected location, rice and curry, rice, pasta and battered prawns cuttle fish and fish was also too good, desserts were all good. To make the sevice to the best we had Captain Buddhika who did such an excellent job, he was soo quick and accurate to attend made me feel as if I have gone to a 7 Star, all the staff including the Manager was great.. The restaurant was very clean All I can say is just go, ask for Buddhika and just loosen your seat belts as your in"
    },
    {
        "name": "Shamalka H",
        "review_date": "Apr 2021",
        "title": "Dinner buffet",
        "review": "Excellent service at 'ports of restaurant' by Dilhara, Gayan, Uddika, Tithila, Dias, Ruwan, Ranaraja. A warm welcome by them and they accommodated our family very well as there were small kids as well. Great food and fantastic people."
    },
    {
        "name": "Themiya C",
        "review_date": "Apr 2021",
        "title": "Dinner buffet",
        "review": "The food and drinks were amazing. The Taj hospitality was up to the global standards. Special thank you goes out to Dilhara, Samapth,Wasala, Dias, Banadra,Chamindu and Warren. Will definitely come again and recommend"
    },
    {
        "name": "Tharindu Ranathunga",
        "review_date": "Apr 2021",
        "title": "Extremely Good Customer Service",
        "review": "Dilhara at Port of Call was extremely good to us during our dinner buffet and was quick to respond to anything and everything we needed. He made it a memorable experience by giving us a compliment and made our night, and he even took our picture. Also, would like to to Thank the Taj Team who made a birthday cake for me and delivered at 12 midnight to our room, and also for the lovely hand made birthday card that was given to me by a friendly staff member the following day."
    },
    {
        "name": "Roshani F",
        "review_date": "Apr 2021",
        "title": "Extremely good service and friendly staff",
        "review": "Visited Ports of the call restaurant with family for dinner. Extremely friendly staff;Dilhara, Uddika, Amila, Lasitha, Thikshana, Ruwan, Charitha who are willing to go an extra mile to assist the customers. Good food and a wide variety to choose with.... The barbeque was the key."
    },
    {
        "name": "Navoda",
        "review_date": "Apr 2021",
        "title": "Dinner Buffet",
        "review": "Port's of call restaurant dilhara amila Buddhika lasitha ruwan theekshana and charitha Had a nice time with delicious food in a calm environment. Staff was really friendly and good service. Recommended for good food."
    },
    {
        "name": "Ruchira J",
        "review_date": "Apr 2021",
        "title": "Dinner Buffet",
        "review": "Such delicious food at Port’s of call restaurant. Amazing service by the entire team including Dilhara, Amila, Uddika, Lasitha, Thikshana, Ruwan and the manager, Charitha. Great variety of food including multiple cuisines."
    },
    {
        "name": "Rebecca Jayakody",
        "review_date": "Apr 2021",
        "title": "Dinner buffet",
        "review": "Had an excellent time with my family at Ports of call. They had an excellent spread in the dinner buffet plus there was a BBQ night going on. Food was of excellent quality the staff was super friendly and nice! Special thanks to the staff members Mr.Dilhara, Mr.Uddika, Mr.Amila, Mr. Lasitha, Mr. Thikshana, Mr. Ruwan and Mr. Charitha for thier excellent service. Definitely will visit again!"
    },
    {
        "name": "Thushan Amarasuriya",
        "review_date": "Apr 2021",
        "title": "Avurudhu Holiday With Family",
        "review": "We came to Taj to take a break during these holidays, chose Taj Colombo as we didn't want to travel long distance. The experience from the reservation call taken by Andrea , check in experience, in room dining to the restaurants was excellent and truly a 5 star experience. With three young kids around us, Dilhara, Dileka and Nilanka at \"ports of call \" restaurant was so helpful and they were so patient and courteous with the constant needs of the kids, the food was very tasty as well. Thank you staff and management of Taj all the best to you during these tough times with the pandemic. We definitely want to return to Taj Samudra."
    },
    {
        "name": "Deborah M",
        "review_date": "Apr 2021",
        "title": "Looking good",
        "review": "Lovely hotel. They have nice restaurants. Specially Navratna Indian restaurant is good. The food is really good. Staffs are great. They have good tasty Indian dishes. Love the thanduri chicken, briyani and butter naan. So yummy. Opposite this hotel Galle face just you can walk to get the nice sea breeze 🙂👌"
    },
    {
        "name": "Deraniyagala",
        "review_date": "Apr 2021",
        "title": "Excellent service-Venue to have lasting memories",
        "review": "We had a very memorable evening at Taj Samudra.. Front office executive Anusha, Ports of call food and beverage executive Ruwan and service personnel/attendant Gayan served us so diligently. Atmosphere was very unwinding and spread of food was wide in selection. Covid precautions were diligently maintained and optimum standards of hygiene was maintained through out the hotel and all restaurants. Highly recommend the Hotel as a suitable choice of venue for official or holiday or recreational purposes.."
    },
    {
        "name": "Shani",
        "review_date": "Apr 2021",
        "title": "Dinner Buffet",
        "review": "On 7th of April, we visited Ports of call restaurant to celebrate our friends 10th year anniversary. The food was awesome and the service was excellent. Sikh ara, Gayan, Thithila, Dias, Chaminda and Warren served us well and it was one of the best services! They provided us with everything we needed without us even asking. They were well synced with the customers requirements!"
    },
    {
        "name": "miflas m",
        "review_date": "Apr 2021",
        "title": "Celebrateed our anniversary at best hotl in colombo",
        "review": "Thank u sooo much taj samudra colombo \"ports of call restaurant \", tasty food in the town and thank u very much Dilhara,Gayan,Thithila,Dias,chaminda and warren for superb service , we are soo happy to join with ul in our special day, ull made our day soo special and memorable , thanks again and we vl visit again"
    },
    {
        "name": "D G Y",
        "review_date": "Apr 2021",
        "title": "Dinner Buffet",
        "review": "We visited Ports of Call restaurant today for dinner. Excellent welcome & service by Dilhara & his team. Food was good with a great variety. Would definitely recommend for a relaxed family dinner or a friendly get together."
    },
    {
        "name": "Shamal Ketimingama",
        "review_date": "Apr 2021",
        "title": "Dimner buffet",
        "review": "Great hospitality followed by super spread of food with a nice culinary form start to finish, all and all great evening with family. Highly commended. Thank you, Port's of call restaurant ( dilhara, athuda, jagath, amila, thilakshana, ranaraja)"
    },
    {
        "name": "Ruguna",
        "review_date": "Apr 2021",
        "title": "PLEASE STAY AWAY FROM THIS PLACE.",
        "review": "Together with booking.com they offer categories of rooms, which dont exist. We paid for a „Taj Club Room“. As per the description, it comes with all sorts of extra services. Access to an exclusive lounge serving hot & cold drinks all through the day, cocktails served in the evening with snacks, ironing service and many more. Funny enough most of the staff are not aware of this. The lady at guest services told us twice that the cocktail hour takes places between 6-7pm every day in the lounge. Only after addressing the duty manager we found out we had been scammed by the hotel and booking.com together. All those additional services had been suspended for more than a year already. Most other higher end hotels have very transparent informations about reduced services so you can be"
    },
    {
        "name": "Nethmi W",
        "review_date": "Apr 2021",
        "title": "Dinner buffet (port of call)",
        "review": "First of all, i would like to say about their excellent hospitality. The Managers, F&B servers they were very comfortable and helpful. They were in touch from the time we started the buffet. Port of call has the best buffet in colombo. The food was very tasty and has varieties of cusines. The dessert had varities of sweets. They had fruits, cheesecake, brownies, choc chip cake, ice creams, and soo many. My Aunty had her birthday and i asked them to arrange a small cake. It was arranged very nicely. All thanks to Dilhara at port of call. Therfore i recommend anyone who is looking for family dinner buffet. The place is also very calming and beautiful. Thankyou for the Port of call Team and specially Dilhara for organising the cake. It was the way i told you to do it."
    },
    {
        "name": "melanie e",
        "review_date": "Mar 2021",
        "title": "Dinner Buffet",
        "review": "The service and the food was excellent and we had a great round of cocktails, the margarita and mojito which was perfectly done by Dilhara. Really enjoyed the dinner. Kudos to Dilhara, chathura, uddika and lasitha."
    },
    {
        "name": "Marino D",
        "review_date": "Mar 2021",
        "title": "Dinner buffet..",
        "review": "Had a Wonderful dinner buffet with my wife today, and it was the first visit to Ports of Call at Taj Samudra.. the Dinner was beautiful and we specially loved the Prawn buriyani, the pork ribs and also the amazing desserts. Excellent service by The entire team , specially Dilhara, Chathura, Wasala , Amila, Lasitha, Ranaraja and Warren. They did an excellent job in always checking on us and being very kind, professional and a very caring team. They also suggested to have Naan, and other items specially made and offered to the table as well.. delicious food, not as extensive as other buffets but all items on the buffet were Superb ! All in all, a wonderful experience. A great place to have a peaceful dinner and a beautiful surrounding.Thank you to a wonderful job by the entire"
    },
    {
        "name": "NilanKandamby",
        "review_date": "Mar 2021",
        "title": "Post covid dine",
        "review": "Needless to say all the precautions have been taken considering the present situation and the staff has taken measures to keep the distance between the tables plus less crowd being a Monday. Staff was very welcoming and was very caring especially dilhara who was helping us with the beverages and suggesting and serving food from the counters. Kudos to a job well done. To RM - sumedha Dilhara, chathura, amila, wasala, lasitha, ranjala & warren."
    },
    {
        "name": "Disura Fernando",
        "review_date": "Mar 2021",
        "title": "Dinner at Golden dragon",
        "review": "Food was amazing. Amazing service by Kasun and Lasantha. Great ambience. Alot of varieties. Location is quite spacious. Staff was decent and friendly. Highly recommended place for Chinese cuisine dinning."
    },
    {
        "name": "Chamila Perera",
        "review_date": "Mar 2021",
        "title": "Golden dragon",
        "review": "Excellent food and service by Kasun, lasantha,eranda!! The refurbished place is good and some of the best Chinese food in colombo ! Visited this place after about 3 years and it’s been transformed in to probably one of the best dinning places around in colombo."
    },
    {
        "name": "Shanil Dayawansa",
        "review_date": "Mar 2021",
        "title": "Thumbs up",
        "review": "Golden dragon was great, food and ambiance was soothing. Kasun Lasantha Eranda was fantastic throughout the whole meal. Very attentive and efficient. Looking forward to the next meal at the restaurant"
    },
    {
        "name": "Ridmi D",
        "review_date": "Mar 2021",
        "title": "Port's of call (Taj samudra)",
        "review": "wonderful service by staff of Port's of call Restaurant.. Our server Dilhara, was very attentive and friendly and did his best to make sure we were comfortable throughout our dining experience at Port's of call rest6 (Taj Samudra)"
    },
    {
        "name": "Shaveen Bandaranayake",
        "review_date": "Mar 2021",
        "title": "Dinner at Golden Dragon",
        "review": "Wonderful dinner date accompanied by courteous service from Lasantha, Eranda and Kasun. Recommended for the Cantonese Fried Rice, Lamb Dumplings and the Sweet n Sour Pork. We will definitely revisit soon 👌🏽"
    },
    {
        "name": "Chandi P",
        "review_date": "Mar 2021",
        "title": "Dinner out for Onel's Birthday",
        "review": "Ports of call (Chaminda) want to say a big thank for the lovely service you gave us and for providing a beautiful Birthday cake from Taj Samudra for Onel's 1st Birthday..really appreciate you all.. Thank you..God bless you.."
    },
    {
        "name": "Ruvantha J",
        "review_date": "Mar 2021",
        "title": "Dinner",
        "review": "Excellent food and cocktails at the Golden Dragon The Service staff was also very good (Lasabtha, Kasub, Thilina, Marlon and Ajantha and Chef Saman) did a very good job The inside ambience was good as well"
    },
    {
        "name": "Lakshani A",
        "review_date": "Mar 2021",
        "title": "Lunch",
        "review": "Food was impeccable and service was incredibly fast! Service by Lasantha, Kasun, Ajantha, Marlon and Thilina was superb! Ambience was very nice and was according to our taste! We will be back soon! Thx"
    },
    {
        "name": "Aisha M",
        "review_date": "Mar 2021",
        "title": "Ports of call restaurant",
        "review": "The food and customer service at ports of call restaurant was great😊 Dilhara,Chathura,Lasitha,Warren and Chamindas’ service was exceptional! Overall 10/10 Will definitely recommend to anyone who wants great customer service👍🏼"
    },
    {
        "name": "David L",
        "review_date": "Mar 2021",
        "title": "Dinner at Golden Dragon",
        "review": "Food and service was excellent. Ambience and was very pleasing. Drink selection and food was delicious and excellent. Highly recommend. Kasan, Lasantha and Wajeera were very professional and provided the best service."
    },
    {
        "name": "Kokila S Mudugamuwa",
        "review_date": "Mar 2021",
        "title": "Dinner",
        "review": "\"Port's of call restaurant\" It was pleasure to have dinner with taj Samudra and very helpful staff. I love to be there every time as much as possible. Dilhara Chathura Amila Thikshana Lasitha Wasala Bandara Ranaraja Warren"
    },
    {
        "name": "Ashi.liy",
        "review_date": "Mar 2021",
        "title": "Lunch buffet",
        "review": "Ports of call restaurant Very friendly and great service. Excelled food Loved the staffs energy through out the service Hoping to visit again The staff is very helpful Dilthara Athauda Wasala Hansi Keep it up guys !"
    },
    {
        "name": "dinesh t",
        "review_date": "Mar 2021",
        "title": "Excellent experince",
        "review": "Dinner with my wife birthday.it was very unfrorgettable experince for me.becauce of we had super food and wonderfull service.golden dragon taj team specelly mention lasantha he was our frindly waiter.we will defenetly come soon..thank for every services.."
    },
    {
        "name": "Pasindu V",
        "review_date": "Mar 2021",
        "title": "Family dinner 👌",
        "review": "It was a wandorfull experiance for us in golden dragon resturant. Superb food highly recommonded crispy lamb and hot b cuttle fish. Olso excellent service from lasantha and the team. They do all good things for celebrete our dinner party. Thanks.. Taj.👍"
    },
    {
        "name": "Wanderlust97",
        "review_date": "Mar 2021",
        "title": "Absolutely Brilliant",
        "review": "This was our 4th stay at the Taj. We stayed for Valentine's day 2021 and as usual, we really enjoyed it. Customer service and the staff were wonderful. We were given the pleasure of having Ms. Dinusha handle all aspects of our stay and we truly could not be more satisfied with her promptness, professional demeanor and eagerness to please. She took care of our check in, which was hence extremely smooth and hassle free, and kept checking in on our experience throughout our stay which made us feel truly valued as guests at the hotel. The ports of call restaurant was wonderful and an easy recommendation for anyone looking to enjoy a buffet which exceeds expectations. Although ports of call was booked up for the night, we never experienced a lack of service and experienced prompt"
    },
    {
        "name": "HK",
        "review_date": "Mar 2021",
        "title": "Dinner buffet at Ports of Call",
        "review": "The food was awesome, and there was a good spread in the buffet. The salad bar and the desserts were the best for me personally. Dilhara and the team who served us were very friendly and helpful. The seating and the ambience were nice as well. Will definitely visit again."
    },
    {
        "name": "Seneeth P",
        "review_date": "Mar 2021",
        "title": "Dinner Buffet",
        "review": "Ports of call Restaurant Dilhara, Chathura,Amila, Lasitha, Wasala, Ranaraja, Warren and Thikshana have served us very well. Will recommend this to everyone. The buffet had a wide spread with meat and veg options."
    },
    {
        "name": "Pahan Rathnayake",
        "review_date": "Mar 2021",
        "title": "Dinner buffet",
        "review": "The food were amazing. The location was really awesome. Safety regulations were really good.Great service by Dilhara, Chathura, Amila, Lasitha, Wasala, Ranaraja and Warren. Good place for family dinner."
    },
    {
        "name": "Supun L",
        "review_date": "Mar 2021",
        "title": "Yumi Japanese restaurant in Taj Samudra Colombo",
        "review": "There are many Japanese food experiences to be had in Colombo but non compares with the dining experience afforded at Yumi in Taj Samudra Hotel. Hardly possible to mention the fare.... every dish is a treat. And with excellent staff to cater to every culinary need. Deserving of special mention is Manjula whose attentive and friendly service added to the excellence of the luncheon."
    },
    {
        "name": "Jenny K",
        "review_date": "Mar 2021",
        "title": "Dinner at Yumi",
        "review": "Was there for a Japanese dinner at Taj's Yumi restaurant. Was highly impressed with the level of cleanliness and beauty at the hotel as well as the restaurant. Courteous staff, no fake smiles. They staff looked like they were doing their job religiously. The soothing decor and lighting brought a nice feel to the evening. Management deserves credit for the job well done."
    },
    {
        "name": "Balasooriya",
        "review_date": "Mar 2021",
        "title": "Dinner buffet at the Ports Of Call restaurant",
        "review": "Visited on the 8th of March 2021 for a dinner buffet to celebrate my daughter's birthday, and it was great! The hotel staff adhered properly to the current pandemic safety regulations, which made me and my family feel safe about having dinner there. The food was top-notch and there was a wide variety for us to choose from. I especially enjoyed the soups, the main course and desserts as well. Since it was women's day, we got a beautifully made complimentary cupcake as well. The staff was very attentive and helped a lot with my daughter's birthday celebration. I would definitely visit again and recommend the restaurant to others. Special thanks to Dilhara, Amila, Athauda, Lasitha, Ranaraja and Warren for the excellent service!"
    },
    {
        "name": "Kavisha S",
        "review_date": "Mar 2021",
        "title": "Dinner Buffet",
        "review": "Had a great dinner at the ports of call restaurant dinner buffet. Excellent service by restaurant staff. Thank you Dilhara, Amila, Athauda, lasitha, Ranaraja and warren at ports of call for the wonderful service."
    },
    {
        "name": "Anusha J",
        "review_date": "Mar 2021",
        "title": "Ports of call restaurant",
        "review": "Food was really delicious and great Ambience.. Seafood , Red Meat and Other food were on Point All the items which was placed on the Buffet were sooo good and Highly Recommended.. Customer Service was Excellent and all the Staff were Friendly and really helpful. Extra Ordinary Customer Service By : Mr.Anushka(front office) (Dilhara , Athanda, Amila, Lasitha, Ranaraja,Warren) Definitely a Highly Recommended place to Visit with Family and Friends to Grace your Occasions and Special Days .."
    },
    {
        "name": "Gangulee",
        "review_date": "Mar 2021",
        "title": "High tea",
        "review": "The staff was very friendly and attentive. We went for the high tea to celebrate a birthday and Malaka and the team was very supportive in arranging a small surprise. Thanks alot to the hotel and the team."
    },
    {
        "name": "Janith K",
        "review_date": "Mar 2021",
        "title": "Perfect welcome from the Front office and excellent house keeping",
        "review": "I was staying in taj for 3 nights the stay was so good , it was a warm welcome from the front office lady Niranjali ( She really knows what is to be hospitable) and resturent was ok not that great , the gym was equipied with modern machines, the housekeeping team specialy sunil looks after the room. Everything was perfect , surely will be returing to the hotel"
    },
    {
        "name": "Kasun M",
        "review_date": "Mar 2021",
        "title": "High tea",
        "review": "Food is very good tasty and yummy service also excellent very friendly staff highly recommended Mr.Lasantha Mr.Kasun and Mr.Malaka provide a good service. Thanks for your valuable service and hope to come back again"
    },
    {
        "name": "tania4185",
        "review_date": "Mar 2021",
        "title": "Ports of call",
        "review": "I am a self proclaimed breakfast person. I enjoyed the breakfast spread at Ports of Call and the ambience. The staff were very attentive and they made sure my needs were met even before I realized my need! Excellent coffee by Dilhara kick started my day. They also made a pack to take with me so that I could feed my infant back in the room. ( we swap breakfast times when we are traveling with the baby). Great hospitality Dilhara, Chaminda, Ravindu , Nilanka and the team! Would come back for sure and stop over for breakfast when ever possible."
    },
    {
        "name": "Romel M",
        "review_date": "Mar 2021",
        "title": "Review for Hightea",
        "review": "The Taj High Tea was a buffet at the time I visited! It was a mix of savory and sweets! It triggers your taste buds! Worth the price! I also liked the structure of the hotel, which was very homely structure. During the period I visited I liked the Christmas Decos which was very eye catchy. 😍😍👌👍"
    },
    {
        "name": "—-ZZV",
        "review_date": "Feb 2021",
        "title": "Chinese restaurant @ Taj Samudra",
        "review": "The service was truly admirable. The staff ( Kasan, Eranda & Danashka ) made all the effort to make our family have a wonderful dining experience! I enjoyed the tea and was even given a sample to take home! The name of the tea brand was also kindly given to me upon request. The portions were good. The ambiance was a blend of contemporary Chinese design. The personalised experience was truly amazing as they catered to our preferences and altered the dishes to make them anti - allergenic. Thank you Taj Samudra! Best Regards, A grateful and happy customer."
    },
    {
        "name": "Shanaka",
        "review_date": "Feb 2021",
        "title": "Dinner Buffet",
        "review": "It was a nice visit out there for a dinner. The team including Gayan, Jagath, Wasala, Ruwan, Chaminda, Ranaraja, Thithila and specially Dilhara at Ports of Call Restaurant was very helpful and generous. The food was delicious and had a wide variety too. Its worth the money we spent."
    },
    {
        "name": "Dewmi W",
        "review_date": "Feb 2021",
        "title": "Great dinner experience",
        "review": "We had a great evening at \"Ports of Call Restaurant \",thanks to the team- Paul,Gayan,Lasitha,Thikshana and Warren,led by Dilhara. They got to know it was my dad's birthday and surprised him with a personal cake. They were such a thoughtful and supportive team and the food was absolutely delicious. Thankyou so much for making our evening a special one."
    },
    {
        "name": "Dilshani T",
        "review_date": "Feb 2021",
        "title": "Great service at Ports of Call",
        "review": "It was a very pleasant evening for our family at Ports of Call restaurant, Taj Colombo . Their food was very good and the service was excellent. We received a friendly service by the team ( Warren, Thikshana, Paul and few others ) led by Dilhara. They were very thoughtful and I was really impressed by the way they treated my little kid by helping to serve and by bringing whatever she needed to the table. Out of all during this covid pandemic period while adhering to all the guidelines provided by the authorities gave us the freedom to self serve providing gloves. Thank you everyone for making our evening a memorable one."
    },
    {
        "name": "Devika Ratnasiri",
        "review_date": "Feb 2021",
        "title": "Visit to Taj, Colombo",
        "review": "I was at the Golden Dragon in Taj with friends on the 23rd February celebrating my birthday. 1. It was Extremely safe during this corona period. 2. Golden dragon staff was very courteous and helpful. The Waiter on us , a gentleman called Wijitha was excellent. 3. Food was delicious and all of us enjoyed the food thoroughly thanks to the chef who prepared it for us. 4. We all agreed that we should go there on other days too as overall it was a super ambience atmosphere. I recommend whoever who reads this to try it at least once, you’d LOVE it."
    },
    {
        "name": "Ekna",
        "review_date": "Feb 2021",
        "title": "Lunch at Golden Dragon",
        "review": "Delicious Food, Every time i Have visited Golden Dragon. Service is Exceptional, as they are around all the time to serve us. Keep up the good service Lasantha, Vijitha and Wajeera. Jasmine Green Tea was refreshing."
    },
    {
        "name": "Ayodhya S",
        "review_date": "Feb 2021",
        "title": "Good service",
        "review": "I visited golden dragon for a lunch with a colleague and Kasun, Lasantha and Eranda gave a very good service. Happy to return, great food as well! Singaporean noodles and the Hot and sour cuttle fish was great..."
    },
    {
        "name": "Gihani",
        "review_date": "Feb 2021",
        "title": "Dinner buffet",
        "review": "“Ports of Call Restaurant” is the best place to have a buffet. Very tasty. Amazing service Dilhara. Thank you so much. Dias, Paul,Gayan,Ravindu,Warren,Chaminda and Wasala. Thank you all for the great service."
    },
    {
        "name": "Rangeesh J",
        "review_date": "Feb 2021",
        "title": "Excellent food and service from Lasantha",
        "review": "Wonderful food and great ambiance. Portions of the food are also good. Yangzhou fried rice is good. Condiments are also good. Lamb dish is my favourite. Jasmine green tea was refreshing.Service from Lasantha is awesome!!!"
    },
    {
        "name": "F. A. Shafeek",
        "review_date": "Feb 2021",
        "title": "Dinner at the Port's of Call Restaurant",
        "review": "My family and I visited the Port's of Call restaurant for an International Buffet. There we were given an excellent service by Dilhara and his team members: Lasitha, Paul, Amila, Ranaraja and Warren. The food was simply excellent and with a massive range of perfect combinations. Every dish tasted had a wonderful taste and unique flavour. It was also very pleasing to see that they maintain all the covid-19 guidelines at all times. We were all so very satisfied with the food and the service provided. Looking forward to another visit.👍😊"
    },
    {
        "name": "poornima m",
        "review_date": "Feb 2021",
        "title": "Dinner buffet",
        "review": "“Port of call Restaurant “ Excellent place to have dinner with a family The ambience was great and good service by Dilhara. Would highly recommend this space to anyone that wants to wind down after a busy day of work."
    },
    {
        "name": "Eileen C",
        "review_date": "Feb 2021",
        "title": "Sunday brunch",
        "review": "For a place that was socially distancing they put us on a cramped table for six. One of us was in a wheelchair which took up space. People were able to help themselves to food which in this climate not good. We came for the bubbles brunch but they only offered sweet sparkling wine. Quality and selection of food has gone down drastically. We did get a cheap still wine alternative, not consistent with a 5* hotel. Waiters did their best but very disappointed in quality and selection of food. This used to be the best in Colombo. No longer I'm afraid."
    },
    {
        "name": "Sharmi",
        "review_date": "Feb 2021",
        "title": "High Tea",
        "review": "Malaka & Team, Thank you for the great experience.. Friendly staff and lovely ambience.. Food was delicious! Will definitely visit again! A lovely way to spend a sunday with friends and family!!!!!!!!"
    },
    {
        "name": "Lahiru H",
        "review_date": "Feb 2021",
        "title": "Valentine lunch at GD",
        "review": "The ambience was great and good service by Lasantha. Would highly recommend this space to anyone that wants to wind down after a busy day of work. Tried lunch on a Sunday afternoon and the food was great!"
    },
    {
        "name": "Davis",
        "review_date": "Feb 2021",
        "title": "Excellent Food and Service",
        "review": "Came to Taj after a very long time for our wedding anniversary and I was not disappointed. The service was extremely good and the food too. Specially Kasun, one of the friendly waiters. Ill definitely come again. Keep it up."
    },
    {
        "name": "Udeshika P",
        "review_date": "Feb 2021",
        "title": "High Tea Buffet",
        "review": "Had a nice experience at the high tea buffet.Everything we tasted was delicious.Excellent service from Malaka and the team, they were friendly and efficient.Ambience was pleasant.It was an awesome experience!"
    },
    {
        "name": "Chathumi D",
        "review_date": "Feb 2021",
        "title": "High tea at the lattice",
        "review": "Had a very nice high tea buffet. Very reasonable price. The staff was really friendly. Was served by Mr. Malaka. Food and coffee was good. A variety of sweet and savouries were available. Very nice ambience."
    },
    {
        "name": "Anjana J",
        "review_date": "Feb 2021",
        "title": "High tea at Lattice",
        "review": "Had the high tea buffet. Was a very reasonable price. Had both savory and sweets on the menu. Food and coffee was excellent. Very friendly staff. Everyone adhered to Covid safety protocols to handle food hygienically. Was served by Mr. Malaka. Highly recommended."
    },
    {
        "name": "Ashan",
        "review_date": "Feb 2021",
        "title": "Best chinese restaurant !",
        "review": "I had a wonderful experience at the Golden dragon. Every staff member I encountered, from the valet to the check- in to the cleaning staff were delightful and eager to help! Special thanks to Mr. Kasun who served us sincerely. Thank you! Will recommend to my colleagues!"
    },
    {
        "name": "Annie A",
        "review_date": "Feb 2021",
        "title": "Mothers birthday",
        "review": "Excellent service by Kasun and Lasantha. Very helpful and a job well done. Food was excellent and they were very helpful to assist is selecting. They were very willing to arrange a cake to celebrate my mothers as well by arranging a cake"
    },
    {
        "name": "Jerome A",
        "review_date": "Feb 2021",
        "title": "Delicious Dining Experience",
        "review": "We were warmly welcomed by the Golden Dragon Restaurent staff. From the time we entered and exited the Restaurent , it was all good service. Food was delicious , thanks to the waiters Kasun and Lasantha who provided us with a excellent service. Highly recommended and will definitely return!!!"
    },
    {
        "name": "FrequentFlier555309",
        "review_date": "Feb 2021",
        "title": "Safe, hygienic and the yummiest food",
        "review": "We visited taj Samudra’s golden dragon restaurant for our anniversary dinner and enjoyed its ambiance, tasty food and hygienic conditions Hospitality is commendable and the friendly servers Lasantha and Kasun made sure we were enjoying our time while enjoying the great meal Recommend the chili lamb with sticky rice , it was out of this world!"
    },
    {
        "name": "Yohombu",
        "review_date": "Feb 2021",
        "title": "Dinner",
        "review": "Service by Lasantha and Kasun. We had a great evening at Golden Dragon restaurant & food was delicious. Ambience was superb & the service was excellent. Ambience is eco friendly Hope to come back again."
    },
    {
        "name": "Donald G",
        "review_date": "Feb 2021",
        "title": "Lunch",
        "review": "Service by Lasantha and Kasun personally attended wonderful service The lunch we ordered was delicious A very peaceful ambiance with soothing music Will want to come again with friends and family Hope this service would continue"
    },
    {
        "name": "Chanduli Rubasinghe",
        "review_date": "Feb 2021",
        "title": "Dinner Buffet",
        "review": "It was a fabulous dining experience at the ports of call restaurant. The spread was amazing, loved the variety of the food! Dilhara, Paul, Uddika, Dias, Ravindu, Warren and Chaminda made our dinner extra special with their amazing service."
    },
    {
        "name": "Sanjay",
        "review_date": "Feb 2021",
        "title": "Dinner buffet",
        "review": "\"Port's of call restaurant\" excellent place with great service really worth for money we spent , variety of different foods and pleasant environment made our day !! Recommend to all enjoy delicious foods!!"
    },
    {
        "name": "chryshp",
        "review_date": "Feb 2021",
        "title": "Restful weekend",
        "review": "My husband and I booked into Taj Samudrato enjoy a weekend. We were allowed an early check in and a late check out. We were upgraded to the club floor. The room had the sea view and was very comfortable and spacious. The housekeeping staff were very good and special mention of Shashika who regularly checked if we were comfortable and if there was anything we needed. The best was the club lounge which we used to relax and read. It was so peaceful and comfortable. The staff at the ports of call too were very attentive and saw to it that we enjoyed the delicious food at the restaurant. My family always enjoys the good food at Taj. It was a great weekend."
    },
    {
        "name": "tnching",
        "review_date": "Feb 2021",
        "title": "Dinner",
        "review": "Visited the Golden Dragon restaurant for dinner. The food was delicious and was high value for money. The service was exceptional. Special appreciation to Lasantha and Kasun who were very friendly and helpful. The food was delivered quickly as well. The ambience of the restaurant was very nice. Overall it was a great experience and would visit again."
    },
    {
        "name": "Yadusha",
        "review_date": "Feb 2021",
        "title": "Dinner",
        "review": "The food was excellent and the staff, kasun and lasatha were extremely friendly and catered to our services immediately! Throughout enjoyed our dinner here:) the ambience at the golden dragon was beautiful!"
    },
    {
        "name": "Firzath K",
        "review_date": "Feb 2021",
        "title": "Anniversary Dinner",
        "review": "Excellent service and we really enjoyed the atmosphere Mr Danushka Lasantha Kasun Food is very delicious and really enjoyed Nice ambiance friendly stuff We definitely tell our friends to come Colombo best Chinese food Thank you so much guys"
    },
    {
        "name": "Jtraveller55",
        "review_date": "Feb 2021",
        "title": "Good Service and very friendly staff",
        "review": "Enjoyed very much our honeymoon stay at taj. All were great starting with the warm welcome. Thanks for the House keeping team Ms. Shashika and Awantha for lovely arrangement at our room. Also a special thanks goes to Dilhara and team(Chathura, Lasitha, Amila, Ravindu, Ranaraja, Waren and Paul)for an amazing dinner and service. Loved the seafood pasta made for us by them. The environment here is calm and quiet. Covid precautions are well maintained.Safe place to stay. Haighly recommend. Thank you all. Haritha & Nishali"
    }
]