[
    {
        "name": "Lakshman",
        "review_date": "Jul 2021",
        "title": "Hilton colombo",
        "review": "One of best hotel in the city of colombo,everything was great,ambiance at the hotel,staff at the hotels,specially good higine method for covid 19,our dinning experience was great,food was delicious,service was excellent,we will back agin next month..thanks"
    },
    {
        "name": "busynights",
        "review_date": "Jul 2021",
        "title": "Hilton Colombo - Home Food Delivery",
        "review": "The lunch I ordered for my wife's birthday was Fantastic! The quality of food, packaging and delivery was all up to world renowned Hilton standards. The food was delicious and the portion size was very generous. The person who delivered the food to my residence was well groomed, smart and helpful, also Keminda who reconfirmed my order from the Hilton was very courteous and professional. The cake which I also ordered was really delicious. Thank you Hilton Colombo for job well done!"
    },
    {
        "name": "madhufernando",
        "review_date": "Jul 2021",
        "title": "EXPERIENCE the EMPEROR'S WOK at HILTON COLOMBO",
        "review": "Emperor's WOK at Hilton Colombo is back. I would say it is even better than last time...even with the 'soft launch menu' as they call it. It is a complete menu, with a great variety of authentic chinese food including a Cantonese selection. When you are used to eat at The Wok, you can't enjoy food from any other Chinese restaurant in Sri Lanka, so we were waiting eagerly for The Wok to be back again. Yesterday we had the experience we always loved. Nothing new to talk about the food, you expect the best and you get the best. They were yummy. True Hilton hospitality, unique customer-focused culture and ambience you always find at The Wok. Basically, We love everything about it. Highly recommending you to try when you are in Colombo."
    },
    {
        "name": "Vidu Perera",
        "review_date": "Jun 2021",
        "title": "Review on our hotel stay and cafe kai",
        "review": "I have being ordering cakes for a few times from Cafe Kai for my family events, and should state that their customer service is brilliant and super friendly! I would recommend anyone to have a look into their menus. Recently I've received a delicious cake and foods on June 2nd which has been ordered by my fiance. They were delivered on time and arrived in the perfect condition. (Super fresh) We've stayed in your hotel on last February and it was amazing to the maximum! Looking forward to visit soon. And should say the customer service proving by Mr. Shaun Windsor is absolutely amazing and brilliant at every point which leads for us to have many more experiences with Hilton Colombo. Highly recommend to anyone!"
    },
    {
        "name": "TJE47103",
        "review_date": "May 2021",
        "title": "Helpful",
        "review": "We have stayed at this hotel many times over the past 17 years. I was disappointed that the executive lounge was closed and several restaurants were not open but I have to say the hotel staff and management went out of their way to help us make changes to our flights and schedule when necessary. Certainly the rooms could use some upgrades but you won’t find a better staff to support you in any needs when in Colombo. I highly recommend the staff and management of the Colombo Hilton."
    },
    {
        "name": "Lakshman",
        "review_date": "Jul 2021",
        "title": "Hilton colombo",
        "review": "One of best hotel in the city of colombo,everything was great,ambiance at the hotel,staff at the hotels,specially good higine method for covid 19,our dinning experience was great,food was delicious,service was excellent,we will back agin next month..thanks"
    },
    {
        "name": "busynights",
        "review_date": "Jul 2021",
        "title": "Hilton Colombo - Home Food Delivery",
        "review": "The lunch I ordered for my wife's birthday was Fantastic! The quality of food, packaging and delivery was all up to world renowned Hilton standards. The food was delicious and the portion size was very generous. The person who delivered the food to my residence was well groomed, smart and helpful, also Keminda who reconfirmed my order from the Hilton was very courteous and professional. The cake which I also ordered was really delicious. Thank you Hilton Colombo for job well done!"
    },
    {
        "name": "madhufernando",
        "review_date": "Jul 2021",
        "title": "EXPERIENCE the EMPEROR'S WOK at HILTON COLOMBO",
        "review": "Emperor's WOK at Hilton Colombo is back. I would say it is even better than last time...even with the 'soft launch menu' as they call it. It is a complete menu, with a great variety of authentic chinese food including a Cantonese selection. When you are used to eat at The Wok, you can't enjoy food from any other Chinese restaurant in Sri Lanka, so we were waiting eagerly for The Wok to be back again. Yesterday we had the experience we always loved. Nothing new to talk about the food, you expect the best and you get the best. They were yummy. True Hilton hospitality, unique customer-focused culture and ambience you always find at The Wok. Basically, We love everything about it. Highly recommending you to try when you are in Colombo."
    },
    {
        "name": "Vidu Perera",
        "review_date": "Jun 2021",
        "title": "Review on our hotel stay and cafe kai",
        "review": "I have being ordering cakes for a few times from Cafe Kai for my family events, and should state that their customer service is brilliant and super friendly! I would recommend anyone to have a look into their menus. Recently I've received a delicious cake and foods on June 2nd which has been ordered by my fiance. They were delivered on time and arrived in the perfect condition. (Super fresh) We've stayed in your hotel on last February and it was amazing to the maximum! Looking forward to visit soon. And should say the customer service proving by Mr. Shaun Windsor is absolutely amazing and brilliant at every point which leads for us to have many more experiences with Hilton Colombo. Highly recommend to anyone!"
    },
    {
        "name": "TJE47103",
        "review_date": "May 2021",
        "title": "Helpful",
        "review": "We have stayed at this hotel many times over the past 17 years. I was disappointed that the executive lounge was closed and several restaurants were not open but I have to say the hotel staff and management went out of their way to help us make changes to our flights and schedule when necessary. Certainly the rooms could use some upgrades but you won’t find a better staff to support you in any needs when in Colombo. I highly recommend the staff and management of the Colombo Hilton."
    },
    {
        "name": "VSanmugam",
        "review_date": "May 2021",
        "title": "Another great stay",
        "review": "Our first travel since the Pandemic, glad it was to one of our favorite Hotels - Hilton Colombo, for its staff and services!. As always, the staff extended fantastic services. This time, amidst the restrictions in services due to the prevailing COVID situation. Keep-up the exemplary effort and awesome attitude. Special thanks to Eranda and Annette."
    },
    {
        "name": "Max J",
        "review_date": "May 2021",
        "title": "Beware of being misled",
        "review": "Spacious room (Executive Lounge) but a couple of lamps burnt out. Apparently house-keeping doesn't check on that aspect. Very good service-oriented staff, esp. in the main restaurant 'Graze Kitchen' where the food was well-prepared and tasty. We got confusing signals about check-in and check-out times. On the phone we were told check-in is from 10 a.m. onwards. We went at 11.30 a.m. and had to wait till 1 p.m. till our room was ready. Some time could have been saved at the reception filling out various forms if they had been emailed to us earlier as some hotels do. On the phone we were told late check-out is permitted upto 6 pm, the emailed confirmation from the hotel stated that check-out is at 12 noon, and another officer said late check-out is possible upto 8 pm. Anyway we"
    },
    {
        "name": "RYAN",
        "review_date": "Apr 2021",
        "title": "Amazing , attentive and very polite staff all around the hotel.",
        "review": "Many thanks to Mr Watowita and Mr Pujitha Gunawardena ( Hilton Residencies) for personally looking into my stay and upgrading the room with a fruit basket and chocolates. The room was brilliant over looking the port of Colombo. All amenities in the room were well fulfilled. Room service was very prompt. The meals at Graze Kitchen and coffee shop was great. I have re - booked a stay this Weekend as well, as the hospitality of staff feels like being at home."
    },
    {
        "name": "kamal d",
        "review_date": "Apr 2021",
        "title": "Class entertainment",
        "review": "Sunset Blue - Hilton Colombo pool side is class and trendy place to hangout in Colombo. Highly recommended for young adults. We celebrated my wife's birthday at this location on a Saturday night, its a beautiful setting with indoors and outdoor spaces. We chose to be outdoors which was extremely nice. The choices and prices of food and beverage was extremely good and reasonable compared to many other places in Colombo. The prices of liquor by the bottle is reasonably priced. Recommend the thin crust pizzas and kotthu rotis. However should improve on the famous hot butter calamari in terms of taste, potion and presentation. Topping all this was the Hilton hospitality and service well managed by the supervisors. The music was good with a band and a DJ. Highly recommended and will"
    },
    {
        "name": "Ram S",
        "review_date": "Apr 2021",
        "title": "Excellent Service",
        "review": "The service at this hotel was excellent. Upon check in, a Fruit Basket and an assortment of Gourmet Chocolates were sent to my room. During the middle of my stay, an assortment of snacks was sent to my room. In addition, to rectify an issue I had at the hotel bar, the manager promptly sent me a bottle of wine. The staff at the front of the house as well as the housekeeping staff were super friendly, always checking to see that everything I needed was provided and if they could do anything else. I had breakfast every morning at the hotel and it was great. They accommodated my requests (even though the items weren't on their regular menu). I was also upgraded to an Executive Floor with a corner room (fantastic view of the city). I am a Gold member. Overall, I had a great"
    },
    {
        "name": "Hasini Vihanga D",
        "review_date": "Mar 2021",
        "title": "Extremely Pleased with Their Great Customer Service (Of Hilton Grand Ballroom)",
        "review": "I attended my friend’s wedding function on 08.03.2021 and started having lunch when the couple was about to leave only. The food station was already closing when I started. Bidding adieu to the couple, I resumed finishing my main course and was looking for desserts and it was already closed. When I inquired, they offered the dessert of my choice from the relevant restaurant in order to make the meal complete for me. They took extra measures to fulfill my craving for the chocolate mousse and that too without an additional cost. The dessert they offered was enough for 10 people to finish and they were kind and patient enough to bear with us until we finished the dessert though they were preparing the same hall for the next function in the eve. Hats off for the greatest service I"
    },
    {
        "name": "lianarachchi",
        "review_date": "Feb 2021",
        "title": "super experience",
        "review": "A really good place to dine, affordable food, accommodation is also very good, this is a place I love a lot. We invite anyone in the world, not just in Sri Lanka, to have this experience, and the friendliness of the staff is very high. Friendly service should be appreciated from the moment you come to the institution until you leave."
    },
    {
        "name": "Ranuka",
        "review_date": "Feb 2021",
        "title": "Coporate Lunch",
        "review": "Hello, I yesterday ordered a take away lunch package to my office staff for number of 42 members from Cafe Kai. I am so happy that everyone of my office mates appreciated the lunch and thank goes to you! Thank you soo much! I would also like to appreciate the great coordination and customer service provided by Achini Poornima for me to arrange this lunch from Hilton Colombo."
    },
    {
        "name": "Randil P",
        "review_date": "Feb 2021",
        "title": "5 star service & amazing welcome",
        "review": "Still the no 1 hotel around Colombo nothing beats their customer service, front desk was so helpful and friendly staff from the moment you enter & leave the hotel. This hotel has a safe environment which is the main reason we selected this property. Thanks to Zainab,Rumeshika,Achini at the front desk for a superb welcome & Mr Rahaman from food and beverage these Guys provided an excellent service & will definitely return back with no regrets. Last but not least thanks to all the staff members for looking after my family & keeping us safe during this tragical situation."
    },
    {
        "name": "Mohan G",
        "review_date": "Jan 2021",
        "title": "Lounge and Bar (LAB)",
        "review": "I am a regular here, but this is my first review. LAB is an excellent place to relax and unwind, listening to the music of \"Miracle\" on a Saturday night. They provide a wide variety of retro music that would keep your mood ticking. The ambiance of the LAB is excellent with a breath taking view of the pond across the glass panes. Would definitely recommend tha LAB particularly on a Saturday night."
    },
    {
        "name": "Brincly",
        "review_date": "Jan 2021",
        "title": "Absolutely great evening",
        "review": "Enjoyed the evening at lobby lounge with some super sounds of the band called Rock this country they are simply amazing proving some great soothing quality music obviously a packed house to listening to this bunch of professional musicians rocking the lobby, you name it they will oblige you with any request in town combined by some great food and service by the hotel staff was a complete package for us for sure we will go again and follow this bunch of passionate musically blessed members not only the singing and backing but the attitude is key of this band Bravo once again keep doing what you are doing ...."
    },
    {
        "name": "Ruhira K",
        "review_date": "Jan 2021",
        "title": "My Favorite",
        "review": "Exceptional and outstanding service always. Food was fabulous . The lady at bell desk very helpful and plesent. Lobby ambience with ship also superb .LAB. great place to chill out. This time we missed the Graze Kitchen breakfast . But had a nicely arranged room service breakfast Cons. TV display menu in RED colour letters not clear. Thank you..... Colombo Hilton 1715"
    },
    {
        "name": "rozpravkar",
        "review_date": "Jan 2021",
        "title": "Avoid if you want to sleep at night!!!",
        "review": "I am very much disappointed to see that my previous review has been deleted. I am lost to understand why and frankly annoyed. My review as all past reviews are truth and assessment of someone who travelled quite a bit around the world. This Hilton hotel is running a club disco right next to its main building. I stayed expecting comfort and good night sleep. Instead room was bouncing every say until midnight sometimes 2am. They focusing on the club not guests staying in the hotel. Avoid at all costs with children and if you want a good sleep. It is impossible to sleep through the loud music. The venue was opened in December 2020. Happy to hear response from Hilton management rather than questioning validity of my review. Is this not the case you are running a loud bar next to"
    },
    {
        "name": "Paul T",
        "review_date": "Dec 2020",
        "title": "Extreme noise pollution at night",
        "review": "I stayed at the hotel on a weekday and had the worst experience ever in the hotel. I would not normally write negative reviews or any reviews but this hotel has a serious issue. Loud music from their bar bounces into the room all night to the point it is impossible to sleep. And I have lived near airport in Dubai for the last 3 years with planes arriving and departing creating noise and I still was not even able to sleep in this hotel! I have complained to the staff they said will speak to manager about the noise levels in the bar. No feedback so again asked and was told they have events on in the bar and will do “something”. Needless to say they did nothing until bar closed and I also not slept. Absolute shocker from Hilton. If you can highly recommend to avoid."
    },
    {
        "name": "thdel",
        "review_date": "Dec 2020",
        "title": "Worth the experience",
        "review": "Xmas gift shop got little choice. drastically declined ambience. Renovation have made lobby smaller and congested. Decor is modern and definitely a face lift. Fragrance of festive season which was the hallmark of hilton was somewhat missing. Spirit of festivities that attracts customers was lacking. Pitty that pandemic also has effected on business. Graze Kitchen. Selection of buffet, quality of food, taste, preparation service surpasses almost everything."
    },
    {
        "name": "manlina21",
        "review_date": "Dec 2020",
        "title": "Graze Kitchen",
        "review": "A big shout out to Robert the head chef at Hilton Colombo and his team for their outstanding service and food. They are truly brilliant and remarkable. Everything was handled with ease and grace from the inquiry to the meal! I am truly impressed with the service definitely one of the best in Colombo! A big shout out to Robert the head chef, he is excellent at what he does and does it with a big heart. The food quality is amazing and so is variety. He is always around to check in on his customers and is fantastic at what he does. I strongly recommend graze kitchen at hilton and their f&b team!"
    },
    {
        "name": "Agnieszka K",
        "review_date": "Oct 2020",
        "title": "Lunch with toddler @ Grazie Kitchen",
        "review": "Excellent customer service by Lalith, senior staff member of the restaurant - extremely friendly and courteous. Keeping high standards during difficult times isnt always an easy task. The lady handling payments on the other hand would need to refresh some of the basic Hilton customer service / code of conduct skills - treating right your co-workers especially trainees doesn't hurt!"
    },
    {
        "name": "Himashi",
        "review_date": "Oct 2020",
        "title": "Curry leaf resturant",
        "review": "It was truely beyond expectation, Mr. Prasad and his staff really friendly , tasty food , in love with kottu and wije’s ice cream. Calypso band was awesome. Can’t believe they can give such a huge spread just for 3588"
    },
    {
        "name": "Dinesh C",
        "review_date": "Sep 2020",
        "title": "Excellent lunch!",
        "review": "We had a fabulous lunch this afternoon with delectable choices of world cuisine beautifully prepared. Special thanks to Keminda for his conscientious customer care highlighting Hilton excellence. Looking forward to next time!"
    },
    {
        "name": "Kaushi",
        "review_date": "Sep 2020",
        "title": "Staycation",
        "review": "We stayed one night at Hilton Colombo in Sep 2020 after the pandemic. They upgraded us to a Executive lounge room in 18th floor. Room was spacious and very clean. They have sanitized everything in the room and they take all the measures to prevent spreading of the deadly virus. They provide a 14k voucher to redeem at any of their restaurants and vouchers for welcome drinks as well. Early check in and late check out is a possibility here. Food was delicious and guests must visit their Sri Lankan buffet at Curry Leaf. All the facilities including Pool, Jacuzzi, Sauna, Steam room, Gym and the Spa are available here but they have some limitations due to the pandemic. Everything was superb and the friendly, helpful staff must be appreciated. One of the best stays in Colombo."
    },
    {
        "name": "Madara Hemachandra",
        "review_date": "Sep 2020",
        "title": "Outstanding service by Chef Chamlie Waidyarathne",
        "review": "We made an order for a corporate event from Chef Chamlie at Hilton, Colombo. The service given by him was fantastic. The food was super delicious. Very reasonable pricing for the quantity ordered. Most of all, we really value how Chef went an extra mile to ensure the order was complete for us. We highly recommend him for his excellent customer service."
    },
    {
        "name": "Steward.Nelson12",
        "review_date": "Sep 2020",
        "title": "Excellent Serivice",
        "review": "Had a lovely stay at the Hilton Colombo. As expected, the rooms were superb the staff was very kind friendly and humble. Especially thanks for the f&b outlet manager Mr. Rajintha Perera who looked after us very well keep your good work & step up the Game. Colombo Hilton is one of best city hotel in Colombo, wonderful location. Great ambiance. Would recommend this place to all my friends and come back again in next year,"
    },
    {
        "name": "Gurumurthy B",
        "review_date": "Sep 2020",
        "title": "Unexpected surprise for us at Hilton",
        "review": "After the Covid pandemic situation, my first time at the hilton colombo, I expected the usual experience that we are used to at hilton, five star service. Yet what I didnt expect was the lengths to which the staff here went to ensure our visit remained as normal as possible in a very different normal. From the young lady Achini at the front door to the fine staff around who went the extra mile to make us comfortable when none of my party even expected it. Quite the pleasant surprise and experince for us apart from the usual good food. Good job guys, keep it up"
    },
    {
        "name": "saman j",
        "review_date": "Sep 2020",
        "title": "Dining at Graze Kitchen . Buffet is delicious. Specially I thank Mr. Iroshan for his excellent service.",
        "review": "Dining at Graze Kitchen . Buffet is delicious. Specially I thank Mr. Iroshan for his excellent service. Hostesses have been very friendly towards the customers. After recovering this Covid epidemic, I expect your earlier atmosphere at dinner buffet with more variety."
    },
    {
        "name": "Harry P",
        "review_date": "Sep 2020",
        "title": "Wonderful hotel with amazing Customer service!",
        "review": "I'm a regular customer of the Hilton Colombo visiting the Lobby, it's restaurants and the Sports centre few times a week. I found the staff well trained and providing a service that is unparalleled. I must especially mention the services that are provided at the Sports centre by Mr Palitha, Sandesh and the team; they are always very helpful and have vast knowledge in the area of fitness and provide an excellent service all together! Keep up the good work! Thank you"
    },
    {
        "name": "UdSe",
        "review_date": "Aug 2020",
        "title": "Amazing value in the heart of Colombo",
        "review": "Had a lovely stay at the Hilton Colombo. As expected, the rooms were dated but was clean. The staff was very kind and humble. The buffet breakfast was extensive with good service. The only hiccup was inconsistent replenishment of amenities and mini-bar during turndown."
    },
    {
        "name": "senadhi",
        "review_date": "Aug 2020",
        "title": "A perfect evening as always at Graze Kitchen",
        "review": "It was indeed refreshing to return to Grace Kitchen on Friday night, after Covid Lockdown. Dinner is as delicious as it always has been. The taste of the Indian , Food is unparalled . Thank you Chef ! The attentive and courteous service of Iroshan, Deleapa and Uma as usual, contributed yet again, to a great dinning experience ! Thank you Manager Indika and Assistants Thushara Sanjeewa and Lalith, who always gives their best to us. It is always a pleasure to be back. Senadhi."
    },
    {
        "name": "TakiLanka",
        "review_date": "Aug 2020",
        "title": "What a feast!!",
        "review": "Colombo Hilton’s Graze Kitchen started the Washoku Lunch Buffet in July this year. Being Japanese myself, I had been craving Japanese food for some time, so I looked forward to their first buffet with great expectations. The place was packed with local Sri Lankans and foreign residents. As soon as I stepped into the restaurant, I couldn’t contain my excitement. There was a great variety of popular Japanese dishes, representing all the well-known types of Japanese cuisine, such as sushi, tempura, yakitori, teppanyaki, okonomiyaki, teriyaki, katsudon and more. I felt like a kid in a candy shop. There were even many different kinds of sushi, and they were also all visually attractive, enticing you to choose one of them. As I needed to leave some space in my stomach for other"
    },
    {
        "name": "Amila A",
        "review_date": "Aug 2020",
        "title": "Dinner at Graze Kitchen",
        "review": "Had wonderful time at Graze kitchen with family for our wedding anniversary today. Food and service was superb specially Dileepa who served us at the restaurant very attentive and professional 5 stars to him and the lady too was very good who was serving us. Sorry couldn’t get her name. Thank you for the wonderful cake to make us surprise. Thank you once again and will be back again soon."
    },
    {
        "name": "S'ubodha P",
        "review_date": "Aug 2020",
        "title": "Excellent service at Kai coffee shop",
        "review": "Gerald Craig at the Kai coffee shop went extra mile to get cookies for us even though it wasn’t available at the counter Excellent service ... we will definitely continue to come and he made the customer very happy"
    },
    {
        "name": "Udari Kodikara",
        "review_date": "Aug 2020",
        "title": "Great service and delicious food",
        "review": "It was very nice place for dine and the food was great,and also the service was very friendly, Deshan serve us at that day and he was very friendly and his service also was very great,I recommend Hilton hotel as a great place to dine."
    },
    {
        "name": "Qahd",
        "review_date": "Aug 2020",
        "title": "Delicious food excellent service and the best manager around.",
        "review": "The staff is extraordinarily friendly and look for your best comfort. Especially warm hearted Manager Prasad who gives the service the personal touch. And delicious local food.thank you all for the culinary experience."
    },
    {
        "name": "Mohideen A",
        "review_date": "Jul 2020",
        "title": "One of best 5 star",
        "review": "Colombo hilton is one of best city hotel in colombo,wonderful location..great ambiance..restaurant,lobby,rooms are very clean and beautiful..,good service staff in every department,food is very delicious..,highly recommended.."
    },
    {
        "name": "Dinuka",
        "review_date": "Jul 2020",
        "title": "Outstanding service",
        "review": "As in Engage with a Hospitality Came for a quick meeting with my friend, So Very tranquil Environment in the Lobby, Same time Service was on spot on, Saduni she is so outstanding, Great service, great movement same time offering ,, suggestive selling & all. We tried your nice kade Tea. Excellent,, Best in the Town in comparison other properties,, Your cookies are truly delicious,, We asked for extra as well, quick word Randuli & Saduni. Keep your good work & step up the Game."
    },
    {
        "name": "Julian Alex",
        "review_date": "Jul 2020",
        "title": "Nice stay",
        "review": "I was there at Hilton Colombo for two days during my stay in Sri Lanka. hotel is situated is busy area but it has nice city view and sea view too. Rooms are great. service also amazing. i had plan to stay just a one day but I extended another day too. I specially like there Foods at restaurant The Curry Leaf. Foods are tasty. a Good place to stay in City premises."
    },
    {
        "name": "NABHAN NIYAZ",
        "review_date": "Jul 2020",
        "title": "AT THE CURRY LEAF",
        "review": "As this was the first time I've been to the curry leaf @ Hilton Colombo I probably must say that this hotel serves food, hygiene, and recognition as more than they must for a VIP, So this hotel must be one of Sri Lanka's best hotel. And I wish in future that they change this hotel into a ''7 STAR HOTEL'' And not a 5-star hotel!"
    },
    {
        "name": "Dilan Suranga W",
        "review_date": "Jul 2020",
        "title": "BIRTHDAY CELEBRATION",
        "review": "we had an amazing time at the curry leaf HILTON. great food and great staff got a complimentary cake and lovely music special thanks to Prasad, Fiona, Rajintha, Chamika well done would love to come back"
    },
    {
        "name": "dasun w",
        "review_date": "Jul 2020",
        "title": "Mr",
        "review": "I went for a dinner,my family really enjoyed the food and service. Tushara and Asanka were great host. There service was great and the setting is good and the whole place is well cleaned. This is great service!."
    },
    {
        "name": "Sahan",
        "review_date": "Jul 2020",
        "title": "Graze Kitchen and The Lab",
        "review": "Good food with excellent customer service... . Specially from Keminda (Kaminda- not sure of the name) Would definitely make a visit again..... Love the band at the Lab. Brilliant music. Entire family had a lovely evening."
    },
    {
        "name": "joanne B",
        "review_date": "Jul 2020",
        "title": "Great food",
        "review": "Hilton 'Curry leaf' one of the best authentic Sri Lankan food restaurants in Colombo..Prasad and Rajintha and the rest of the staff thanks for your warm and pleasant service at the curry leaf..we really enjoyed"
    },
    {
        "name": "Dulanka B",
        "review_date": "Jul 2020",
        "title": "Delightful Lunch",
        "review": "Visited Graze Kitchen and we had a delicious lunch. The Ala Carté menu had a good variety to select from. The Thai rice and the Cheese cake we chose was mouthwatering, a must try when you visit. Staff were very welcoming and health and safety standards were being followed by staff members at all times. Will definitely visit again."
    },
    {
        "name": "Salani Ostwald",
        "review_date": "Jun 2020",
        "title": "Birthday dinner",
        "review": "Had a great time with wonderful service from Dileepa who was attending us. Made my birthday extra special with the special seemed! Thank you Hilton :) Keep up the great service and welcoming atmosphere. Will be back soon :)"
    },
    {
        "name": "poomzy",
        "review_date": "Jun 2020",
        "title": "Birthday Celebration at Graze Kitchen",
        "review": "I made a dinner reservation for my sister's birthday and asked them to arrange something special. They had arranged us a table decorated with rose petals. They brought a cake with a music group and sang Happy Birthday. We were truly surprised and we loved it. So glad I chose Graze Kitchen. Great food :D"
    },
    {
        "name": "Michael D",
        "review_date": "Jun 2020",
        "title": "I had a very nice stay",
        "review": "I stayed here for a few days after spending some time in the south. Pros would be hotel was modern and in a good location. Service was at the highest levels you would expect from the Hilton brand. I was given access to the executive lounge as a Gold member. I was there the first few days of March and the staff was already taking precautions to prevent spread of Covid by wearing masks. When I hired a driver to take me on a city tour the concierge made a point of bringing over to me some individually wrapped hand wipes I could use throughout my tour as I left. I thought it was a nice touch at the time and now feel it was an even nicer gesture in hindsight. The hotel was also very helpful in arranging transportation to/from the airport. My cons for this hotel are on the mild"
    },
    {
        "name": "eran s",
        "review_date": "Jun 2020",
        "title": "Cafe Kai",
        "review": "I live in Canada and I wanted to deliver a cake for my Father's birthday. I tried ordering the cake and get it delivered from many local online sites but it said the order cannot be completed with in 24 hours. I called Cafe Kai and Mihiri was extremely helpful. Chamara from the food and beverage reservations also coordinated my order very well and the order was delivered within 2 hours. Cafe Kai does a great job with a great team. Keep it up guys."
    },
    {
        "name": "Henry240",
        "review_date": "Mar 2020",
        "title": "Best Hotel in Town",
        "review": "Many people had recommended newest hotels in the city but we had to go with Old is Gold, From arrival till departure the staff were amazing nothing much more to say, they did took extra care of us without any shortfalls, service impeccable, staff from the main breakfast restaurant simply got our preferences from day one not forgetting the champions from housekeeping and Executive Lounge such and unforgettable experience we made family away from home. The lobby Christmas decorations truly resembled a touch of luxury thank you guys for keeping the place amazing and thumbs up to everyone who makes it the best place in Colombo."
    },
    {
        "name": "Ishan",
        "review_date": "Mar 2020",
        "title": "Rooms & Breakfast",
        "review": "We had an early morning check in but faced many challenges & took ages to check us in...Rooms should be renovated soon...This is one of the best hotels in town years back & a new touch will impress guests...However the breakfast spread was overwhelming...Thoroughly enjoyed every day we stayed with them..."
    },
    {
        "name": "Arnab S",
        "review_date": "Mar 2020",
        "title": "Still going strong after three decades; superb F&B options",
        "review": "We stayed here for two nights as part of our week-long trip to Sri Lanka during early March 2020, just before the COVID-19 crisis would reach its peak in this country. This was a family trip for the four of us and like before each such trip I contacted the GM to check on a few things. My email exchange with GM Manesh Fernando turned out to be quite pleasant. I am Honors Gold and the status was recognized. We were immediately confirmed for a very early check-in (around 6 AM), got upgraded to a corner suite and even had an extra roll-away placed in our room. I was a bit surprised to know that they didn’t have a kids club or the sort, while direct access to the pool side via the bridge was off during our stay. However, with the kind of packed schedule we had during our time"
    },
    {
        "name": "capitalkid186525",
        "review_date": "Mar 2020",
        "title": "Very good Hotel",
        "review": "Hotel a bit tired in places but facilities and service very good. Staff very friendly and breakfast buffet amazing.Got a late check out with no extra charge as a diamond member ! Would definitely recommend this Hotel as excellent location."
    },
    {
        "name": "Ampys",
        "review_date": "Mar 2020",
        "title": "Best view hotel n amazing food",
        "review": "Great place for business as well leisure travelers. Very close to all places. Nice food n big rooms. Great staff behaviour. Many veg food options available. Must n highly recommended place everyone who wants to be in Colmbo for a trip"
    },
    {
        "name": "Vinod V",
        "review_date": "Mar 2020",
        "title": "Great stay",
        "review": "Highly recommend this Hotel and location was excellent ,great facilities ,Beautiful water garden lots of fish and swans by the restaurant. Staff were excellent would do anything to help. At evening we dined at the bar restaurant with live music and were well looked after by mr (Saman Gamage) and his team excellent service. All the lobby staff were also very helpfull and we got attached to all member of staff, hope to see you all soon , and thanks for your great service, God bless you all"
    },
    {
        "name": "Nigel P",
        "review_date": "Mar 2020",
        "title": "Great 5* hotel in great location",
        "review": "Love this hotel. Breakfast was great, rooms were great, well equipped gym, spacious rooms in great location. Staff very accomodating prticularly in the restaurants where they would be happy to produce items not on the menu. Only thing missing is a rooftop bar."
    },
    {
        "name": "mihaela f",
        "review_date": "Mar 2020",
        "title": "Excellent Executive Lounge!",
        "review": "This a nice hotel with a newly renovated lobby and restaurants, which are always quite full and very lively. But what really stood out for us was the executive lounge. It has a good variety of food and nice drinks. Thanks to Krishantha Perera, the lounge manager, and his team for making our time in the lounge great."
    },
    {
        "name": "Christine J",
        "review_date": "Mar 2020",
        "title": "Comfortable Stay",
        "review": "Stayed for 2 night 3rd and 4th March could not fault the service. Rooms may require some updating but are spacious and beds and pillows excellent. The staff cannot do enough for you. Buffet in the restaurant was excellent and live music in the bar. The best Hilton I have stayed in"
    },
    {
        "name": "Jv055",
        "review_date": "Mar 2020",
        "title": "Business Trip - regular",
        "review": "Always a pleasure to be at this Hotel .....with staff who understand needs and cares especially the Breakfast service at Lounge ....special mention for Mr. Dinesh and Sachila...excellent attention to details"
    },
    {
        "name": "runner051",
        "review_date": "Mar 2020",
        "title": "Exceeded expectations",
        "review": "Classic luxury Hilton. Extremely secure. Every single staff member was outstanding. The executive lounge was perhaps the best I have ever experienced at a Hilton with daily food offerings that varied and included lots of different Sri Lankan food. I was there for 3 days and didn’t eat or drink anywhere else. Level of service exceeded all of my expectations."
    },
    {
        "name": "Philipp G",
        "review_date": "Feb 2020",
        "title": "Short trip to Colombo (2 nights)",
        "review": "We arrived in the evening and booked the pick up service from the hotel. Our stay was short, but really comfortable. Everything was great - Service (easy check in) - breakfast (big choose) - cleanliness"
    },
    {
        "name": "KEITH P",
        "review_date": "Feb 2020",
        "title": "Relaxing for business or pleasure",
        "review": "We are frequent visitors to this hotel. We start our travels in Sri Lanka from this hotel, staying here 2 or 3 times a year. It is handy for money exchange and local shops. The staff are always friendly and welcoming from opening the car door to closing it when you depart. The rooms are comfortable if a little dated but everything we need is there. When there is time for a swim the pool is clean and welcoming. The pool attendants are always helpful in moving sunbeams around to search for shady spots. It would be helpful if there were sun umbrellas close to the sun beds rather than only around the tables, though. Tania De Mel books our rooms and always makes sure we have a good room in a position we prefer. The housekeeping staff are discreet and efficient. The best"
    },
    {
        "name": "DeeWHY2020",
        "review_date": "Feb 2020",
        "title": "Great staff, restaurant, lobby and lounge. But the rooms need renovating",
        "review": "Lobby and exec lounge have been renovated and are great. Staff are warm, attentive and helpful. Breakfast offerings at Crave is excellent. However, the rooms are really lacking. Desperately need updating. As a Diamond, your exec benefits are great, but if you're just staying in your room, you'd probably consider somewhere else."
    },
    {
        "name": "Jayne",
        "review_date": "Feb 2020",
        "title": "Amazing food and wonderful people",
        "review": "I stayed here for 5 days during a work trip. It’s a beautiful hotel, with amazing food and great people working there. It was particularly great for work and the conference I was there for, all went smoothly."
    },
    {
        "name": "Fred Runkel",
        "review_date": "Feb 2020",
        "title": "Best Customer Service Ever",
        "review": "I stayed at the Colombo Hilton in early/mid Feb. 2020 for a little over one week. From the time I arrived at the hotel, I found the staff courteous and helpful in all aspects. What most impressed me what they continual and consistent friendliness every time I arrived at the hotel, came down for breakfast, or departed. This was also the time of the coronavirus, and all hotel personnel wore masks for protection. This concern did not detract from their service to ensure that all of my needs were seen to. The facilities are fine, but what sets this hotel apart from all others is their attention to their clients. I stay at many hotels during the course of a year, and Hilton Colombo, you have been the friendliest that I have ever experienced!! My hat's off to you! Thank you."
    },
    {
        "name": "khosrowadeli",
        "review_date": "Feb 2020",
        "title": "Excellent Experience Overall",
        "review": "Excellent facilities and service; had a great experience staying at Hilton Colombo. The staff were very professional and helpful. The executive lounge was particularly helpful and offered great service and an outstanding breakfast."
    },
    {
        "name": "Timothy",
        "review_date": "Feb 2020",
        "title": "Service is good except the concierge",
        "review": "The service from the guards, counter staff and room service are very good. Rooms furniture are old. The one experience that left a very bitter taste is the concierge. I have left instruction that my transport should be a sedan car and not van-like vehicles. And that’s what they did, gave me a van. Not once but multiple times when I stayed at the hotel over the years. It seems the concierge do not know how to take simple request."
    },
    {
        "name": "Cardiardaith",
        "review_date": "Feb 2020",
        "title": "Central Colombo stop-over before touring Sri Lanka",
        "review": "Good location in old fort district with intetesting historical buildings and close to Fort Train Station - a five minute walk but a busy, dense traffic route with uneven pavements if you have luggage so a taxi preferrable. Old Dutch Hospital opposite has good eating places if you don't want to eat at hotel. Agree with reviews that say rooms are a bit dated, noisy air con and not quite 5 star but have to commend the pool area and the gardens and the excellent Executive Lounge with charming service. As a Gold Hilton Hons Member we were given an upgrade to Exec level and allocated a room on arrival at 8am after a long flight without additional charge. Breakfast was on eof the nicest we've had in an Exec Lounge. Worth paying the extra for Exec room if you need to as Exec Lounge"
    },
    {
        "name": "jnmcthomas",
        "review_date": "Feb 2020",
        "title": "5 Star experience with personal touch",
        "review": "We had a very pleasant stay, and looking forward to our next visit, to Colombo, SriSrila. Thanks to everyone at Hilton, especially to Zainab, Sachith, and Krishanth. Zainab made us feel like we are with family. How can we not visit them again?"
    },
    {
        "name": "m0nm0nster",
        "review_date": "Feb 2020",
        "title": "Manager Chamantha",
        "review": "I cannot thank this gentleman enough. He takes a great care of the tourists visiting Colombo. I came to him on sunday 16/02. Even though at first staff of the hotel informed me that they cannot help me he did few calls and he managed to solve my problem. He is very dedicated to what he does. When I was waiting in the lounge he came to me few times to make sure I know he didnt forgot about me. He and his team are absolutely fabulous. Thanks a lot and all the best Chamantha!"
    },
    {
        "name": "lfuentes2020",
        "review_date": "Feb 2020",
        "title": "Lock your luggages!",
        "review": "Nice location but the rooms are old and the security is an issue. The staff don't know how to handle issues especially when something disapear from your room. So lock your luggages as a box of tea is not a way to compensate your loss."
    },
    {
        "name": "Ken M",
        "review_date": "Feb 2020",
        "title": "Business trip for an exhibition",
        "review": "The staff were extremely polite and professional. The rooms and facilities were all clean and well maintained. The gym is well equipped though perhaps a little dated but this did not detract from the condition of the equipment"
    },
    {
        "name": "pkd2018",
        "review_date": "Feb 2020",
        "title": "Great business hotel",
        "review": "Had a nice ocean facing room. Been in this hotel a dozen times. Like everything. The room is just right though I find the working desk badly designed. It has a sharp corner which can hurt. Other amenities good. Breakfast buffet is excellent. I always enjoy a bit of the live music in the lobby bar after a day's work. The Executive Lounge is well appointed and the service is excellent."
    },
    {
        "name": "Brandon H",
        "review_date": "Feb 2020",
        "title": "Hilton Colombo stay",
        "review": "I stayed four nights at the Hilton Colombo. The hotel was very nice, there was good security, and the staff was friendly and helpful at every turn. I didn’t eat in the main restaurant, but I had food and refreshments at the cafe and bar during my stay. Once again the service was great. Akalanka, from the hotel, went above and beyond checking in with me to make sure everything was going okay and sending me hand written notes."
    },
    {
        "name": "Stephen H",
        "review_date": "Feb 2020",
        "title": "Great Staff, very average rooms",
        "review": "Staff couldn't be nicer - which is just the typical Sri Lankan way. Restaurant food is good for breakfast and dinner and once again waiting staff are just amazing. Unfortunately the rooms are just a little 'tired and worn'. I would suggest this is an adequate hotel if the location is convenient for your business needs, but would suggest you look further afield if the room itself is important to you."
    },
    {
        "name": "Mr & Mrs B",
        "review_date": "Feb 2020",
        "title": "Excellent exec Lounge & fab pool etc",
        "review": "We stayed her for 2 nights and loved it. The exec lounge was one of the best and the pool superb for what is a city hotel. The room was a bit tired. If I were to stay again I would ask for a rear room as ours looked out over a noisy and very busy road. Staff were at attentive. Would definitely stay again albeit in a better room."
    },
    {
        "name": "Cudabkk",
        "review_date": "Feb 2020",
        "title": "Good location",
        "review": "Good location in the heart of the city. A good selection of restaurants However the rooms and furniture old. Rooms need to be refurbished. Not 5 star standard at all. I stayed in a club suite and this just very average or below. Service, staff excellent. Very friendly and accommodating."
    },
    {
        "name": "Roy Jawaheer",
        "review_date": "Feb 2020",
        "title": "Food presentation at the happy hour",
        "review": "Amazing hospitality. Wonderful staff, nothing seems to be a problem. Attentive and helpful Provided great safety and security to all guests. The staff always greet the customers with great respect and warmth. They all show great ability to engage in conversation to make us feel part of their community We are all going to Iceland next week and staying at the Hilton It would be interesting to experience the reception we shall receive there. This would give us the opportunity to see the different standards of hospitality in two different countries"
    },
    {
        "name": "Tom Schoemann",
        "review_date": "Feb 2020",
        "title": "Amazing staff",
        "review": "Very much enjoyed my many stays at the hotel. The staff is the most polite and caring group I’ve experienced in my travels. ManurI @ KAI and Ghana in the executive lounge stood out among the amazing people who worked at the hotel."
    },
    {
        "name": "Chathurika Subhani",
        "review_date": "Feb 2020",
        "title": "Best hotel in Colombo",
        "review": "Fantastic property, most friendly and observant staff! The lunch buffet at Graze was excellent and thank you cafe KAI for lovely birthday cake with such a surprise.Nice Christmas decorations and we got a chance to win gift also. 😊😊 Big thanks to all staff for making our day memorable with pleasant, will definitely come back you ! Cheers 🥂"
    },
    {
        "name": "Radu I",
        "review_date": "Feb 2020",
        "title": "It’ a Hilton! You get what you expect.",
        "review": "Me and my spouse stayed here at the end of our 3 weeks journey to Sri Lanka. While the stay in Colombo itself was a bit of a mistake to put in my trip, Hilton was again a an excellent experience. Staff very friendly and friendly."
    },
    {
        "name": "PS@1",
        "review_date": "Feb 2020",
        "title": "Would definitely visit again",
        "review": "Very good property, very friendly, professional and competent staff. Good internet and TV channels . The bathrooms could do with some newer fittings, but this did not detract from the overall experience at all. Would definitely stay there again."
    },
    {
        "name": "Naga",
        "review_date": "Feb 2020",
        "title": "Good stay at Hilton",
        "review": "Staying at Hilton Colombo is like going home. Familiar faces, Wonderful service and efficiency. Despite the age of the property, it is well maintained. The executive lounge staff are attentive and courteous. Krishanta in particular. The concierge staff are very helpful."
    },
    {
        "name": "IRELANDSMAN",
        "review_date": "Jan 2020",
        "title": "SUCH A TERRIBLE LOCATION FOR A SWIMMING POOL",
        "review": "I have had 3 recent stays at this hotel---in which the Sri Lankan Government has a stake. The lobby area and Executive Lounge have recently been upgraded and it shows--elegance. One of the most important issues in this hotel is the location of your room---if you are in the area of room 1 it is very noisy and in 25 a great pleasure. Rooms are pleasant but bathrooms are very old. The Executive Lounge is a delightful restful area where the staff are very kind under the care of a most professional hotelier --KRIS the manager. The swimming pool area is far from the main hotel requiring you to walk across the road using a bridge. Here the umbrellas are very limited and generally very few guests go there."
    },
    {
        "name": "KatR",
        "review_date": "Jan 2020",
        "title": "Feels like home",
        "review": "This was our second time staying at the Hilton and from the moment we checked in the staff welcomed us back with open arms. From daily greetings to casual conversations and even expressing sadness we were leaving it really made our stay feel so homely. Thank you for the attention paid to our little one making sure she was well looked after. Even leaving a surprise for her in the room. Our room was always cleaned efficiently and in room dining never took more than 10 mins to deliver. It is the staff that really make this hotel special and we hope they keep up the good work"
    },
    {
        "name": "Neel1980",
        "review_date": "Jan 2020",
        "title": "Good hotel excellent staff.",
        "review": "The only issue with the hotel is rooms, they are getting old and definitely needs a refresh, the staff and food is very goood, may be the owners need to make a call to refresh the rooms, carpet and overall experience in rooms."
    },
    {
        "name": "Trail789294",
        "review_date": "Jan 2020",
        "title": "worn out hotel",
        "review": "I just checked into this hotel. Not 5 star material for sure. This is an old hotel, where the furniture in the rooms is all beaten up, shabby bathrooms and just everything is very blah. Do not waste your money."
    },
    {
        "name": "Frequent Traveler",
        "review_date": "Jan 2020",
        "title": "Superb Birthday Party with excellent Service",
        "review": "I hosted my sons birthday was hosted at Graze Kitchen Hilton Colombo for about 15 pax for buffet dinner. From the reservation to leaving time all the staff members were so courteous . The birthday package was a great deal too. I have 0% complaints. Totally satisfied with the awesome service. Will recommend to anyone Hope it will last throughout."
    },
    {
        "name": "Katykats8",
        "review_date": "Jan 2020",
        "title": "Shame on Hilton Brand",
        "review": "Not what I expected, the hotel site said ocean view, what one got was a view of concrete jungle. The most disappointing was the access to the gym. One has to go through a workout to get to the gym for a workout!!! The gym is across the road, one has to walk the entire length of the hotel, walk down, yes walk down 4 flights to reach a small puny gym outside of the hotel premises!! Can’t believe it’s the HILTON"
    },
    {
        "name": "LSS",
        "review_date": "Jan 2020",
        "title": "Gracious & Dedicated Hospitality",
        "review": "This is one of the finest Hiltons. Yes the rooms are a bit dated but the truly gracious staff at a very early check-in, the breakfast and executive lounge hospitality and a dedicated consierge, Mr. Radcliff, in his long efforts to locate a Sri Lankan unique ayurveda tea and essential to locate that one local shop in Colombo, were oustanding. Kudos to the staff and management!"
    },
    {
        "name": "clarathattil",
        "review_date": "Jan 2020",
        "title": "Hilton High Tea",
        "review": "Excellent and yummy food and a good spread. Went that way after some but was not disappointed. The place looks enchanting after the refurbishment. Lovely setting.The service was good.Keep it going !!! Clara Thattil."
    },
    {
        "name": "phait_lee",
        "review_date": "Jan 2020",
        "title": "A Hilton hotel can't go wrong",
        "review": "Stayed in Hilton Colombo for 2 nights. It is an old hotel that needs to refurbish its rooms. But the rooms and beds are very clean and comfortable, which remains to be Hilton's great level of service. The breakfast spread is vast and awesome....my favourite was the Sri Lankan dishes which include stringhoppers, egg hoppers, idli, dhal, po sambol etc. And there were also the western spread of eggs, bacon, baked beans and toast, and there was a section serving Chinese dishes e.g. dimsum and noodles. I could go on and on about the breakfast spread. Had the dinner buffet on our final night there and at a price of LKR2,500 oer person, the spread was awesome. There were Sri Lankan dishes comprising curry and fresh seafood, Western meals of steak and pasta, and free flow of juices."
    },
    {
        "name": "SoozG",
        "review_date": "Jan 2020",
        "title": "convenient location",
        "review": "+ Beautiful hotel grounds. Walking distance to dutch hospital though I wish the hotel had warned me that men on the street, not just around the hotel, would strike conversation, about working in the hotel, being an off duty police officer or tour operator, or with some sob story about tsunami victims and try to convince me to get into a tuktuk. DO NOT SPEAK TO PEOPLE ON THE STREET. Sad when you have like to get to know locals but these ones are after your money. food really delicious. - the pool, gym and spa are on the other side of a road and accessible via a bridge. gym looks dated spa is a huge disappointment: Not to Hilton standard. Treatment was ok but spa was just couple of tiny rooms. room deco needs updating,"
    },
    {
        "name": "Sam22213",
        "review_date": "Jan 2020",
        "title": "Excellent hotel, great service",
        "review": "I paid less than AUD250 and was treated like royalty. The staff are so accommodating and gave me early check-in and late check-out so I didn’t have to wait around the lobby until my airport transfer arrived at 8 pm. Great pool, great buffet breakfast- I would definitely stay here again."
    }
]