[
    {
        "name": "Hazel R",
        "review_date": "Yesterday",
        "title": "Anniversary Visit",
        "review": "Enjoyed our visit..... The hostess Amalsha was super! Kind courteous and attentive. She had a super balance of giving us attention but also not being intrusive. We were surprised with a cake for our first wedding anniversary anniversary arranged by Amalsha. Well done team lakeside....."
    },
    {
        "name": "SharmilalAnthony",
        "review_date": "Jul 2021",
        "title": "Ordered Food Online",
        "review": "My family is a great fan of Long Feng and visits very often. However due to COVID we moved to order online and except the very first time next 04 orders the food quality is very very poor. The Sea Food we loved at the restaurant is now hopeless, dry as ever. This despite requesting the staff whom we contact normally being informed. I STRONGLY recommend not to order specially from Long Feng the rice. This is my personal experience being a regular visitor previously."
    },
    {
        "name": "Kavini Virada",
        "review_date": "Jul 2021",
        "title": "Dinning room",
        "review": "It has being a lovely dinner experience at cinnamon lakeside. Comfortable environment and the food was delicious. I really appreciate the friendly and warm service given by Ms Amalsha. Thank you for the well spent night."
    },
    {
        "name": "Janaki A",
        "review_date": "Jul 2021",
        "title": "Enjoyable Stay",
        "review": "We stayed at Cinnamon Lakeside for my son's birthday. Our room was decorated and had a cake for him which was such a nice surprise. We had a great time. The staff were very friendly and the food was great. A very special thank you to Gayani, James, Gayen and Samadi for the excellent service. Thank you Cinnamon Lakeside for a memorable stay."
    },
    {
        "name": "Praveen Vimukthi",
        "review_date": "Jul 2021",
        "title": "Our Wedding & stay at Cinnamon Lakeside",
        "review": "A big thank you for Cinnamon Lakeside Hotel ! An amazing place for weddings and for a stay! Food was excellent and the staff was very friendly and supportive (from the most junior to the senior) 🙏👍 A special thank you to Sampath Rashitha for coordinating everything to make our special day and the event a success! Thank you 🙏👍👰‍♀️👨‍💼"
    },
    {
        "name": "Hazel R",
        "review_date": "Yesterday",
        "title": "Anniversary Visit",
        "review": "Enjoyed our visit..... The hostess Amalsha was super! Kind courteous and attentive. She had a super balance of giving us attention but also not being intrusive. We were surprised with a cake for our first wedding anniversary anniversary arranged by Amalsha. Well done team lakeside....."
    },
    {
        "name": "SharmilalAnthony",
        "review_date": "Jul 2021",
        "title": "Ordered Food Online",
        "review": "My family is a great fan of Long Feng and visits very often. However due to COVID we moved to order online and except the very first time next 04 orders the food quality is very very poor. The Sea Food we loved at the restaurant is now hopeless, dry as ever. This despite requesting the staff whom we contact normally being informed. I STRONGLY recommend not to order specially from Long Feng the rice. This is my personal experience being a regular visitor previously."
    },
    {
        "name": "Kavini Virada",
        "review_date": "Jul 2021",
        "title": "Dinning room",
        "review": "It has being a lovely dinner experience at cinnamon lakeside. Comfortable environment and the food was delicious. I really appreciate the friendly and warm service given by Ms Amalsha. Thank you for the well spent night."
    },
    {
        "name": "Janaki A",
        "review_date": "Jul 2021",
        "title": "Enjoyable Stay",
        "review": "We stayed at Cinnamon Lakeside for my son's birthday. Our room was decorated and had a cake for him which was such a nice surprise. We had a great time. The staff were very friendly and the food was great. A very special thank you to Gayani, James, Gayen and Samadi for the excellent service. Thank you Cinnamon Lakeside for a memorable stay."
    },
    {
        "name": "Praveen Vimukthi",
        "review_date": "Jul 2021",
        "title": "Our Wedding & stay at Cinnamon Lakeside",
        "review": "A big thank you for Cinnamon Lakeside Hotel ! An amazing place for weddings and for a stay! Food was excellent and the staff was very friendly and supportive (from the most junior to the senior) 🙏👍 A special thank you to Sampath Rashitha for coordinating everything to make our special day and the event a success! Thank you 🙏👍👰‍♀️👨‍💼"
    },
    {
        "name": "Mohammed Bilal M",
        "review_date": "Jul 2021",
        "title": "Excellent service",
        "review": "We went to Long Feng Restaurant at Cinnamon Lake side After long time, It is really amazing experience, Food is very fresh 🤗thank you to chef madusanka and service was extraordinary by Arshad🤗 atmosphere is very pleasant. We will be definitely back thank you long feng team.👌👌👌"
    },
    {
        "name": "Omaya",
        "review_date": "Jul 2021",
        "title": "A Relaxing Stay",
        "review": "Stayed here in the presidential suite for a quiet family getaway, since inter-provincial travel is still not possible. Although we have earlier stayed as repeat guests in properties like Cinnamon Bay, Hikka Tranz, Cinnamon Wild and Cinnamon Citadel, It was the very first time we had patronized a Cinnamon City hotel as stay-in guests and we were not disappointed. We absolutely loved the cozy atmosphere of our suite, which came with all the trimmings; a Grand piano, 2 bedrooms with large ensuite bathrooms, 2 spacious comfortably furnished lounge areas, separate dining area and a wide, breezy balcony with scenic views of the city including the Beira Lake and Lotus tower. We were offered some free inclusions such as a lovely bottle of wine, fresh fruit, cake and chocolates. Lunch"
    },
    {
        "name": "Dharani E",
        "review_date": "Jul 2021",
        "title": "Great service and good food",
        "review": "We are looking for a fine dining in Colombo in the middle of COVID-19 and finally landed here for lunch. They maintained COVID-19 guidelines very strictly to ensure safety of their customers. Superb collection of scrumptious international cuisine Thank you Samadhi ,Yohan , Vinoli u all very friendly Samadhi was very active and ensured the comfort of every customer."
    },
    {
        "name": "Supun S",
        "review_date": "Jul 2021",
        "title": "Hospitality at its best",
        "review": "A Beautiful hotel with a very clean room, Amazing location and an excellent service from everyone.Especially The dining room staff very helpful excellent spread. Warmest welcome received from Samadhi & Vinoli from service staff personal attention was given By Yohan. Outstanding service at the restaurant and made our stay very enjoyable. 👍🏾👍🏾👍🏾👍🏾"
    },
    {
        "name": "zainab m",
        "review_date": "Jul 2021",
        "title": "Dinner buffet",
        "review": "Dinning room Dinner buffet was fabulous. The service is on point chefs and host amalsha did great job. Nothing to complain about. Planning to visit with my family in another 3 days for lunch buffet.ass manager nishantha and manager prabath went extra miles to make my date night a good one"
    },
    {
        "name": "craig c",
        "review_date": "Jul 2021",
        "title": "Great service and Good Food",
        "review": "Warmest welcome received from the staff and personal attention was given by Mr. Sanjeewa and his team towards the whole evening for my family. Also not forgetting the chef for the great food. Great job"
    },
    {
        "name": "pavan h",
        "review_date": "Jul 2021",
        "title": "Lobby high tea",
        "review": "Had a great relaxing after lockdown. Specially Mr.Sanjeewa & team gave great amazing hospitality under safety guidelines. And food also amazing. Friendly staff service. highly recommend. Thank you so much !"
    },
    {
        "name": "Dhanee de z",
        "review_date": "Jul 2021",
        "title": "Stay at cinnamon",
        "review": "Food was excellent and staff very friendly..I like to thanks to Ms Samadi...she is always with Lovely smiling...with this covid 19 situation they have taken good safety action....I like to thanks to all of you.... We had good time.... Hope to came back again....."
    },
    {
        "name": "Sirak D",
        "review_date": "Jul 2021",
        "title": "Hospitality at its best",
        "review": "A Beautiful hotel with a very clean room, amaizing location and an excellent service from everyone we came across in the hotel. Special thanks to 'Arshad 'from Long Feng restaurant who gave us an outstanding service at the restaurant and made our stay very enjoyable by suggesting us on what to do in the city. We will definitely come back. Thank you"
    },
    {
        "name": "Gayashan Rajapaksha",
        "review_date": "Jul 2021",
        "title": "Travel Safe During Pandamic.",
        "review": "We really enjoyed the food and service at Cinnamon lakeside Hotel. All of the staff very friendly and helpful. Great service and good place to visit with the family. Because of that they follow the all COVID - 19 guidelines properly. It's very important this pandaamic situation. Thankz for the amazing service provided by Mr Poobalan and Waruna in the restaurant. What a great experience. Thankz for the service provided by Cinnamon Lakeside Hotel. ❤️"
    },
    {
        "name": "Tharaka W",
        "review_date": "Jul 2021",
        "title": "Great experience",
        "review": "Lovely stay at cinnamon lakeside! We really enjoyed the food and Service. Especially at the Dining room all the staff is very helpful Morning breakfast was really good also the service Samadhi &! Vinoli helped us lot. During Ala carte Thank you Guys keep it up"
    },
    {
        "name": "Methsara",
        "review_date": "Jul 2021",
        "title": "Tasty Food,Excellent Service",
        "review": "I had lunch at Royal Thai,it was fabulous. The food was so fresh and 👌,poobalan and the service team gave excellent service.You can taste wide range of authentic Thai cuisines and highly recommend. Thank you Royal Thai team and will be back soon..."
    },
    {
        "name": "Migara",
        "review_date": "Jul 2021",
        "title": "A great evening",
        "review": "The food was excellent which can choose according to the preferences. I enjoyed a lot. And the staff was really friendly and helpful. Mr. Poobalan who is a member of the staff did a great service....."
    },
    {
        "name": "Ishan A",
        "review_date": "Jul 2021",
        "title": "Excellent Customer Service",
        "review": "There was a excellent customer service in Thai Restaurant. I was there with my friends and we had a good time.Specially thank you Mr. Dilhara for making that moment such an enjoyable one. Highly recommended !!"
    },
    {
        "name": "Sithuruwan Chm",
        "review_date": "Jul 2021",
        "title": "Awesome food, great people and great time",
        "review": "Excellent service and awesome food. Elegant Thai restaurant atmosphere at cinnamon lakeside. Manager Deen, poobalan and staff were very helpful, they gave their fullest care for me and my family. We had great time as a family at Royal Thai restaurant. You can taste wide range of authentic Thai cuisines and highly recommend. Thank you Royal Thai team and will be back soon..."
    },
    {
        "name": "Chami Laksahani",
        "review_date": "Jul 2021",
        "title": "Lunch Buffet",
        "review": "Lunch buffet was definitely worth the price. It had a lot of varieties to choose from and we had a quality time while having lunch. The ambience was great and the staff too. Especially Ms. Samadhi was excellent when serving us. All the safety measures were taken into consideration by them and we felt safe to dine with them. Highly recommended!!"
    },
    {
        "name": "nirmalashiromanie",
        "review_date": "Jul 2021",
        "title": "Appreciation",
        "review": "Recently stayed at the Cinnamon Lakeside.The stay was excellent .even during Covid Pandemic , the staff at the reception , housekeeping , and the specially the crew in the restaurant were done the excellent job. Thanks for everyrhing rrendered towards us."
    },
    {
        "name": "Sachini F",
        "review_date": "Jul 2021",
        "title": "Breakfast at Dining room",
        "review": "We love cinnamon lakeside and always enjoy their delicious selection of food served at their breakfast buffet! They Have amazing spread throughout their lunch and dinner buffets as well. Special shoutout to the team and their loving amazing service which always makes us feel so welcomed! Thank you to Amarasinghe, Vinoli, Samadhi, Nashantha, and for your patience, and fantastic service every day! We truly appreciate it!"
    },
    {
        "name": "Asela P",
        "review_date": "Jul 2021",
        "title": "Stay at cinnamon lakeside",
        "review": "Lovely stay at cinnamon lakeside we really enjoyed the food. All the staff very helpful. Best place to visit. The hotel follows all the covid 19 precoutions. Rooms also very clean. Especailly Dining room buffet Amazing service staff also very helpfull excellent customer service Thank you Samadhi ,Vinoli & Amarasinghe.😄😄😄😄"
    },
    {
        "name": "Nalina Narampanawa",
        "review_date": "Jul 2021",
        "title": "Family Dinner delivery to Upfield Lanka",
        "review": "Hi Chef! We enjoyed your lovely dinner. It was amazing and delicious! Keep up the same momentum! Appreciate your standards even during pandemic situation. Hats off to you and your team! Nalina Narampanawa"
    },
    {
        "name": "Keerthi P",
        "review_date": "Jul 2021",
        "title": "Friendly and Great service with best COVID Safety Measures",
        "review": "Really appreciate the customized service of Samadhi and her team at Dining Room. They have all COVID safety measures ensuring health and safety. Meals are exceptional with a higher buffet spread. 🥰🥰🥰"
    },
    {
        "name": "Nene",
        "review_date": "Jul 2021",
        "title": "Good food. Great service. Peaceful ambiance.",
        "review": "So glad to be back at Lakeside. Amazing food and great service as always. Feels safe to be back. Covid regulations are being followed. Love the environment. Safe and friendly. Staff is super friendly especially Samadhi who gave us a great service."
    },
    {
        "name": "Tharini h",
        "review_date": "Jul 2021",
        "title": "Amazing food and staff!",
        "review": "Good selection of food, Sri Lankan breakfast is great.. staff is amazing! Really helpful and kind.. thanks Samadhi for being a great host :) The rooms are so clean and well equipped, have nothing to complain about! hope to come back soon!"
    },
    {
        "name": "Vimasha W",
        "review_date": "Jul 2021",
        "title": "Excellent food and service",
        "review": "Best dinner had so far in the Colombo hotels. We have been to different type of hotels in Colombo but yesterday dinner buffet was so good. Had plenty varieties & excellent quality. I'm in cilantro suite which is infront of the lake view which ease your stress always. Good room & excellent room service. 👌 samdhi who was so helpful in the restaurant ( the dinning room) did a excellent job by taking care of us & all the guests. All the staff was so polite and good. Good experience we had. Thank you cinnamon lakeside & all the best. Vimasha & anuththara"
    },
    {
        "name": "Hasintha Jayarathna",
        "review_date": "Jul 2021",
        "title": "Family Dinner Pack",
        "review": "Dear Chef, Thank your very much for your lovely food, it was a unforgettable dinner for our family, not only that your hospitality service and on time service make us comfortable. Again and again thank you."
    },
    {
        "name": "Priyasamara",
        "review_date": "Jun 2021",
        "title": "Absolutely amazing!",
        "review": "I have used Cinnamon Lakeside deliveries repeatedly since covid, and the service is AMAZING! They are prompt, responsive, completely devoted to service, and will go to great lengths to ensure top notch service, even under short notice and challenging circumstances. Nisansala, Shalinda, and Samitha in particular are noteworthy and an asset to Cinnamon Lakeside. THANK YOU"
    },
    {
        "name": "Marlon P",
        "review_date": "Jun 2021",
        "title": "Excellent service 👍👍👍",
        "review": "I ordered food to be delivered to my Parent‘s 50th wedding anniversary 🥳 Delivered on time, food was delicious and top quality 👍👍 Nisansala gave us a super good service and coordinated everything and made so easy for us .. It was a super experience and highly recommendable 👍👍👍"
    },
    {
        "name": "Nishani D",
        "review_date": "Jun 2021",
        "title": "On time delivery",
        "review": "Ordered food from lakeside on the father's day. Delivery was on the spot l, came on time. The food was very tasty and good flavour. My order was an Biryani. Great service from the team and special thanks to ishan."
    },
    {
        "name": "Harshani D",
        "review_date": "Jun 2021",
        "title": "Food & delivery",
        "review": "I ordered food several times and they were well packed and food were excellent. I would like thank the team for excellent service provided and specially to Mr Ishan Rodrigo. Delivery service also very good and delivered on time."
    },
    {
        "name": "Erandika D",
        "review_date": "Jun 2021",
        "title": "Very pleasant service and amazing accommodation",
        "review": "The hotel rooms were very spacious and comfortable. The staff was very supportive and accommodated all our requests within a short period of time. The food was so lovely and prepared with so much care. Hotel followed all the COVID-19 guidelines set by the government. We had a great time and can’t wait to return."
    },
    {
        "name": "Zainab Z",
        "review_date": "Jun 2021",
        "title": "Best Sri Lanka Biriyani",
        "review": "Cinnamon Lakeside is my absolute favourite hotel in Colombo, mainly because of the divine taste of their Biriyani😋 Today we ordered Biriyani for my birthday and as of no wonder the taste was absolutely delicious, and I love the unique taste of Papadi Chaat and Raitha, the flavour of Mint sauce is what makes the combo more delightful. As well the Biriyani was fresh, well packed and was delivered without any delays.. When considering the quality the prices are reasonable! I would highly recommend Cinnamon Lakeside Biriyani for everyone and will definitely order back again. Thank you team for the divine Biriyani😋"
    },
    {
        "name": "udaya j",
        "review_date": "Jun 2021",
        "title": "Delivery",
        "review": "Ordered a delivery for lunch today and was very disappointed. Although the packaging was attractive, food was tasteless. Chicken and beef tasted the same. All watery. Even the rice was not fresh. Have dined at lakeside few times but never expected this."
    },
    {
        "name": "Thilina",
        "review_date": "Jun 2021",
        "title": "Delivery",
        "review": "Thanks for delivery team it was great taste of the food. Its very good.the biryani the way you all Pak untill received. Very hot. Well done gentleman.keep it up will do the order again very soon.i will inform ed management as well"
    },
    {
        "name": "Chamodi Jayawardana",
        "review_date": "Jun 2021",
        "title": "Compliments!!!",
        "review": "I would like to thank the team Cinnamon Lakeside for delivering food with care during COVID-19 pandemic. The food was delicious and also I would like to mention the staff member,Srimal who delivered the food was very pleasant and friendly. Highly appreciate your service. Keep up the good work 😊"
    },
    {
        "name": "Shamara825",
        "review_date": "May 2021",
        "title": "Royal thai delivery",
        "review": "Excellent food from Royal thai delivered amidst COVID-19 lockdown. Fresh and tasty flavors.We were especially grateful to Samadhi Cooray for her professional and efficient service! Thank you very much for making the effort to call after the delivery to make sure everything was ok."
    },
    {
        "name": "VKP PERERA",
        "review_date": "May 2021",
        "title": "A day to remember...",
        "review": "We would like to thank cinnamon lakeside crew for making a memorable honeymoon stay. Firstly , we thank Mr Dalana Madurasinghe for providing details and suggesting Cinnamon Lakeside as our honeymoon destination. A very friendly person who perfectly arranged and understood our needs. Furthermore we would like to highlight Ms. Gayani Punchihewa, for her initiative and quick response. She put effort in arranging the honeymoon cake and other stuff when we checked in. Also she took time to take care of the other needs with her personal attention in a professional manner. Also thanking Mr Ishan for arranging a candlelight dinner with a short notice. Ishan and his crew put their full potential to make us a surprising poolside dinner. During the pandemic, Mr Prasad/ Ms Vinoli and"
    },
    {
        "name": "Malinda Dias",
        "review_date": "May 2021",
        "title": "This hotel deserves six stars!",
        "review": "I checked in last week to spend my weekend at lakeside. The package was very fair comparing to other hotels in Colombo. The service which was offered by Stefano Joel who is the Sales Manager and his team was immense. I really loved my stay here. The food was very nice and the view too. Hoping to visit again."
    },
    {
        "name": "Tanya Sundaram",
        "review_date": "May 2021",
        "title": "Excellent Location",
        "review": "I often stay in this hotel whenever I travelled to Sri Lanka. The location is great. The best buffet compared to many other cinnamon hotels. The choices of both Sri Lankan and international food is excellent. The chef made exactly how I wanted my food. All the room service, reception, concierge and bar staff were very quick in providing what ever I needed with professional and sensitive manner. I will continue to go there."
    },
    {
        "name": "Max J",
        "review_date": "May 2021",
        "title": "Affordable Luxury",
        "review": "Sri Lanka's most luxurious hotels have become accessible to the local residents due to slashed prices consequent to lack of overseas visitors during this pandemic. The Cinnamon Lakeside is Cinnamon Grand's sister hotel and is equally good or better due to its better location bordering the Beira Lake. The check-in could have been expedited had the various declaration forms been emailed to us as done by Cinnamon Grand. We had a spacious room overlooking the Lake but we were warned that we might be disturbed due to music upto mid-night from a location below. We were offered a room on the road-side if we preferred to avoid the noise. We declined.... big mistake, the music went on till 2 a.m. The hotel's Thai Restaurant is exceptionally good with very tasty dishes and excellent"
    },
    {
        "name": "acmemc",
        "review_date": "May 2021",
        "title": "Good Place for Thai Food in Colombo",
        "review": "Very nice place. Ambiance is good. Indoor AC restaurant as well as outdoor restaurant tables available. Wide choice to select from All dishes ordered by 6 of us arrived quickly. Nice taste. Good Ambiance and very attentive staff."
    },
    {
        "name": "KANCHANA NANAYAKKARA",
        "review_date": "Apr 2021",
        "title": "Goddies restaurant at Cinnamon Lakeside",
        "review": "We are regulars at Cinnamon Grand and love the staff and the management. For a change l thought of visiting lakeside for a coffee and a bite. We were disappointed see only one staff was running around like a “headless chicken” and trying please all the customers. Felt very bad of our waiter/cashier/host who did all these with a big smile on his face. Big thank to “Mohammed Rizwan” for working under the pressure yet smiling.. Restaurent- prices have gone up about 20% yet the ambiance of the hotel is kind of depressed in the morning hours. I would highly recommend anyone to visit Cinnamon Grand instead of Lakeside. Managers here are lack in the smile we get at the Cinnamon Grand. FYI - we love Colombar though and we visit them mostly every weekend!"
    },
    {
        "name": "Kusal R",
        "review_date": "Apr 2021",
        "title": "The Staff of Family",
        "review": "I was at the Cinnamon Lakeside for a day function and found myself missing my mobile phone. It was the staff of the hotel made immense effort and made it their problem. I must namely thank Randil, Nizam, Mohan, Hettiarachchi from the hotel security staff as well as Meththananda. They did all possible from checking cctv footages, tracking my device and eventually made the effort to turn the hotel upside down and found it. Thank you guys."
    },
    {
        "name": "Lalitha P",
        "review_date": "Apr 2021",
        "title": "Best hotel in the city",
        "review": "Very good spread plenty of variety of food. All the staff very helpful...all the staff very positive & helpful.went to dining room lunch Absolutely thrilled to see no degradation in quality of service.. the preventive measures were in place from the start. We were constantly greeted with smiles and pleasantness from Samadhi as always. would highly recommend for a special occasion or even a casual lunch."
    },
    {
        "name": "Iyanthi Mundigala",
        "review_date": "Apr 2021",
        "title": "Birthday Lunch at the Dining Room Cinnamon Lakeside",
        "review": "I would like to thank Ms.Samadhi and the whole staff at the Dining Room at Cinnamon Lakeside Colombo for arranging a lovely surprise for my husband as per my request. We visit the Dining Room frequently but it never fails to amaze us with the wide array of delectable cuisine and great hospitality."
    },
    {
        "name": "Isuru L",
        "review_date": "Apr 2021",
        "title": "Birthday lunch @ Cinnamon Lakeside",
        "review": "would like to thank Ms.Samadhi & the whole staff of Dining Room @ Cinnamon Lakeside Colombo for arranging a thoughtful surprise for my husband's birthday as per my request. We visit the Dining Room @ Cinnamon Lakeside frequently and it never fails to amaze us with the wide array of delectable cuisine and great hospitality."
    },
    {
        "name": "Sajani V",
        "review_date": "Apr 2021",
        "title": "Excellent service and great ambiance",
        "review": "Being a regular customer of cinnamon lakeside,I would love make an amazing review about the hotel. I have been to the Sunday brunch as well as the fellow restaurants. Specifically I visit the dinning room outlet frequently because of the excellent and professional service of Samadhi. Would highly recommend this hotel to anyone."
    },
    {
        "name": "Sameera N",
        "review_date": "Apr 2021",
        "title": "Colombar",
        "review": "Chill night out colombar this is the best place .i ever visit ...exactly i ll be visit every week ..spacial thank thank to mr bandara .he was so inteudrcing your spacial drink what i drank local ararack cocktail .that was amazing .he s a best saver i,d ever seen in this colombar ... cool i wish in my deep wish all .of colombar team .good luck."
    },
    {
        "name": "cpanel t",
        "review_date": "Apr 2021",
        "title": "Birthday lunch at Cinnamon lakeside",
        "review": "Lunch was amazing and tasty so many delicious foods. Excellent and professional service from Samadhi.Would highly recommend this place and the sunday lunch experience we had was memorable. Lovely and and delicious birthday cake.Cheers"
    },
    {
        "name": "Erandika Sithambaram",
        "review_date": "Apr 2021",
        "title": "Exceptional",
        "review": "We hosted our nieces birthday party at the Dukes court last weekend . We started off our initial planning with Stefano who has been our biggest support. Stefano was very professional yet friendly and very knowledgeable with all aspects pertaining to the booking and event . No request was too small for him and he made sure that we had everything we wanted even down to the matching table linen with the color theme of the party . Then on the event was managed by Rashitha and the captain in charge on the day Nishantha . Both of these people plus Nishantha’s team gave us their best support on the day of the event . We had very many demand to which the team always supported with a smile on their faces . A special mention to be made on Chef Kumara who was the silent star behind the"
    },
    {
        "name": "Suvini E",
        "review_date": "Apr 2021",
        "title": "Compliments to the best service",
        "review": "The provided service in the dining room is up to a very good standard! Especially Samadhi made the service given to us very quick and friendly.More of course is that the hotel facility and she’s very cautious of the COVID that she takes really good precautions."
    },
    {
        "name": "Arachchi W",
        "review_date": "Apr 2021",
        "title": "Lovely hotel",
        "review": "We stayed at lakeside one night. Great experience my family had a fantastic time. All the staff are very helpful. Security' front office especially the main restaurant staff Samadhi ' 'Dilhani Asmi gave us a memorable experience Thank you 😊 🙏"
    },
    {
        "name": "Surein Edirisinghe",
        "review_date": "Apr 2021",
        "title": "High tea",
        "review": "My self and my family enjoyed the high tea a lot especially when the captain on duty Mr.sanjeewa gave us a super excellent service and looked after us very well . My hats off for him . All the best sanjeewa and may you continue to do the same for all your other guests as well . This is FYI Mr.Kamal Munasinghe ."
    },
    {
        "name": "Ranusha S",
        "review_date": "Apr 2021",
        "title": "Dining Room",
        "review": "Excellent service and good food. Nice atmosphere. Manager Gayan and staff were very helpful. Wide range of delicious meals to choose from and highly recommend. Often visited and especially recommend manager gayan as well."
    },
    {
        "name": "Connector751599",
        "review_date": "Apr 2021",
        "title": "Restaurant review",
        "review": "Great Service by Samadhi!!! She went out of her way to get us the beverages we wanted and was very efficient. Food was good and selection was decent given the prevailing Covid constraints. All in all good experience"
    },
    {
        "name": "Manjju",
        "review_date": "Apr 2021",
        "title": "Highly recommend",
        "review": "It's good to see this please happening again with people. The best bar in Colombo to chill out with live music.unic cocktails was excellent and good atmosphere.Thank you bandara and your colombar team for your great hospitality.will be back soon."
    },
    {
        "name": "Tharinda M",
        "review_date": "Apr 2021",
        "title": "Mr Tharinda Paranavitana",
        "review": "One of the best hotels l have visited, food was amazing, colorful and creative. We had a great time. We had the opportunity of capturing magical moments in picture, it was a wonderful experience that we will not forget. The staff was very friendly and knowledgeable, the service provided was above and beyond. Thank you."
    },
    {
        "name": "DLihini",
        "review_date": "Apr 2021",
        "title": "Awrudu brunch at lakeside",
        "review": "Food and service was excellent. There was an extensive buffet with many choice. Samadhi was really helpful. We came for a full board stay during avrudu holidays and the vibe was excellent.Enjoyed our stay and the food."
    },
    {
        "name": "Rizvi M",
        "review_date": "Apr 2021",
        "title": "Dinner.n stay",
        "review": "Excellent service and hospitality team cinnamon lake . specially Samadi at dine in . her care and service. Awesome. Gym instructor so knowledgeable and friendly wonderful atmosphere one of the best property at Colombo Thank you cinnamon lake side cheers."
    },
    {
        "name": "Sahl Cj",
        "review_date": "Apr 2021",
        "title": "Lovely hotel",
        "review": "Stay at cinnamon lakeside it was great experience lovely location with high security. All the staff very friendly service was excellent. Breakfast buffet we really enjoyed Samadhi she’s outstanding with her service such a great Manager. Thank u cinnamon lakeside hope to visit again again."
    },
    {
        "name": "Nailah H",
        "review_date": "Apr 2021",
        "title": "Fabulous Lunch",
        "review": "The food was excellent. We especially like the dessert. The ambiance was great. As regular customers Samadhi, the assistant manager, has been very hospitable. We enjoyed our time in Cinnamon Lakeside."
    },
    {
        "name": "Shakthi Perera",
        "review_date": "Apr 2021",
        "title": "Wonderful lunch at Dining Room",
        "review": "Had a wonderful and tasty lunch with few family friends at Dining room, cinnamon lake side. Though it’s C-19, they had a full blown lunch buffet! ( with COVID restrictions) Samadhi at the reservations was helpful and always checked on us time to time! Keep up the good work guys!"
    },
    {
        "name": "Nimsara P",
        "review_date": "Apr 2021",
        "title": "Awurudu high Tea",
        "review": "Enjoyed a well organised high tea here at the Cinnamon Lakeside. Great music, great food ,great customer service and all in all very well done to the management and staff of the Cinnamon Lakeside. Really well done, wish to come here for Awrudu next year aswell. Thank you for the Lobby Team."
    },
    {
        "name": "Tanu18",
        "review_date": "Apr 2021",
        "title": "Lunch at cinnamon lakeside",
        "review": "Buffet was excellent. Great range of food. Lovely service. Good job done by Samadhi. Very pleases with everything. Lovely dessert range. Wonderful atmosphere. Will be coming back. They have taken necessary actions to handle the current pandemic situation."
    },
    {
        "name": "Nishani G",
        "review_date": "Apr 2021",
        "title": "Lunch buffet",
        "review": "My husband and me are frequent visitors at Cinnomon Lakeside. We’ve always like their spread and the taste of the food at Dining room. Their customer service is excellent and especially Samadhi, one of the Assistant Managers in the Dining room is provided us the best customer experience while dining in the restaurant. She has been very attentive and serve the customers always with pleasing smile. More than being an Assistant Manager she was made us feel so comfortable and homey and we have enjoyed the food tremendously We wish Samadhi all the best foe her future endeavors."
    },
    {
        "name": "Mayuri Gallage",
        "review_date": "Apr 2021",
        "title": "Had the best time!",
        "review": "Had a girls’ weekend and had an absolute great time! For a hotel in Colombo, Lakeside is one of the best if you want a relaxing experience. We stayed in the Cilantro suite and it had such an amazing view of the city! A big thank you to Stefano for helping me with the booking and making sure everything was perfect during my stay. Amazing service, price, location, food and ambience. Can’t wait for the next stay!"
    },
    {
        "name": "Nadeesha Dissanayake",
        "review_date": "Apr 2021",
        "title": "Great food & amazing service",
        "review": "Do yourself a favor and visit this lovely lounge in Cinnamon Lakeside. The service is unmatched. The staff truly cares about your experience. The food is absolutely amazing – everything we tasted melted in other mouths. Absolutely the best meal we had while in the lounge. Highly recommend! Great service offered by Sanjeewa."
    },
    {
        "name": "Moreen A",
        "review_date": "Apr 2021",
        "title": "Easter Brunch",
        "review": "The food is very good the service also excellent. We really enjoyed with my parents. Very friendly staff Especially Thanks to Samadhi & Sumedh I love the desserts layout it was well organized difinetly we will come back."
    },
    {
        "name": "ASMR T",
        "review_date": "Apr 2021",
        "title": "Easter Brunch",
        "review": "The food was really amazing. Its really fresh & tasty l must say the service is really great in the dining room. Superb spread plenty of variety food nice presentation. Thank u Samadhi & team for memorable service."
    },
    {
        "name": "Badagini A",
        "review_date": "Apr 2021",
        "title": "Easter Brunch at Cinnamon lakeside",
        "review": "We had a lovely at Cinnamon lakeside it was great experience superb spread. Lovely desserts corner. All the staff is very helpful. Especially Samadhi & Team also Kitchen staff superb Chef Desus & all chefs are doing a great job."
    },
    {
        "name": "Nisha sen",
        "review_date": "Apr 2021",
        "title": "Sunday Easter lunch buffet",
        "review": "The food was amazing, such a huge variety of food and so much flavor.everyone had to wear the masks and disposable gloves when serving. It was spaced out well. Overall a very enjoyable lunch. A must have u for someone who hasn’t had a buffet in Colombo yet."
    },
    {
        "name": "Janitha Jayakodi",
        "review_date": "Apr 2021",
        "title": "Anniversay celeb | Lunching at The Dining Room",
        "review": "Starting off with the anniversay part, the staff with Vinoli take the charge was super helpful in pulling off an amazing surprise to my better half. They went that extra mile to help us settle on a good spot, arranging the surprise setup very neatly and making us feel attended to, one hundred percent of the time. Bravo on the effort! Next up, we took the chance to try out a new spread and by far, lunch buffet at The Dining Room is the best we have tried out of Cmb! The categories and their respective variety was amazing with top quality taste, look and arrangements, once more - super friendly and attending staff, good ambience and venue arrangements. Overall, the lunch was of top notch, making the 3,100 LKR net worthy to the bits. Kudos and gracias for the service quality"
    },
    {
        "name": "Daydream790546",
        "review_date": "Apr 2021",
        "title": "High Tea",
        "review": "Excellent High tea. Enjoyed the food and ambience. Worth the price. Dessert could have been better. But overall enjoyed the food. Will definitely come again. Hotel experience after a very long. Cheers"
    },
    {
        "name": "Jithma R",
        "review_date": "Apr 2021",
        "title": "Lobby lounge dinner",
        "review": "The food was really amazing. It's really fresh and delicious. I must say, the service is really great in the lobby lounge in Cinnamon lakeside Hotel. The ambience was really calm and very impressive. Overall this was a greater experience."
    },
    {
        "name": "Tyrone E",
        "review_date": "Apr 2021",
        "title": "Excellent Service at Dining Room",
        "review": "The food here was excellent! Real value for the buffet rates. We had lunch as a family as one us celebrated a birthday. They were nice enough to provide us a lovely birthday cake on a complimentary basis. I must also mention the staff service here is excellent! One Miss Samadhi was extremely nice and ensured we had all we need. She had a chat with us making us feel warm and welcome. Overall an excellent experience! Recommend you guys to try the buffet here!"
    },
    {
        "name": "Charles A",
        "review_date": "Apr 2021",
        "title": "Fabulous Lunch at Lakeside",
        "review": "Wonderful food. 😍 loved the Japanese selection and desserts were great.👍 Very good safety precautions for Covid-19. Excellent service by Samadhi. Will surely return to Cinnamon Lakeside for more. 😀"
    },
    {
        "name": "Tyronne",
        "review_date": "Apr 2021",
        "title": "Lunch at Lakeside",
        "review": "We had a great time at Lakeside and excellent customer service offered by Samadhi. Cinnamon Lakeside follows all covid-19 regulations and it's safe place to dine in. The food was tasty and Cinnamon presents a hospitable environment here."
    },
    {
        "name": "Fathima S",
        "review_date": "Apr 2021",
        "title": "Stay at Cinnamon lakeside",
        "review": "Food was great Wonderful service Kind staffs Had a great stay It’s was a lovely experience with my family everyone was really happy with service especially Samadhi & Azmi they gave a wonderful experience"
    },
    {
        "name": "Nadee Perera",
        "review_date": "Apr 2021",
        "title": "Best Hospitality",
        "review": "we are long-staying guests at the hotel and we had a great experience at the Dinning room restaurant especially with Mrs samadhi and the team's, their excellent customer handling skills, exceptional care they were focused on the customer and met all our requirements. Also want to mention the great vibe in the lobby bar. Thank you very much for your hospitality."
    },
    {
        "name": "Natasha",
        "review_date": "Apr 2021",
        "title": "Nice and cool place to relax",
        "review": "Delicious coktails and great service.Attentive staff and very kknowledgeable what they are serving.Great selection of food with the live music.specialy like to thank bandara and his colombar team for there great hospitality.Recommended for drink and dance ."
    },
    {
        "name": "Sasanka",
        "review_date": "Apr 2021",
        "title": "Vibes in the city",
        "review": "Having arrived to celebrate one of my friends birthday party at colombar in lakeside. We made our resavetion through the telephone and we never be there before. They were acknowledge us with a wormer welcome and colombar friendly staff fulfilled all our needs with perfection. Thank you Bandara and your team who make a memorable evening."
    },
    {
        "name": "Ashan Fernando",
        "review_date": "Mar 2021",
        "title": "Dinning Room Buffet Service",
        "review": "Best hotel & Best delicious food. We had a great dinner and had an excellent service. Well protected against covid-19. Food were super tasty. Clean environment. ♥️ Mr.Ishan and Mr.Gayan were very helpful. Thanks a lot 🙏 Can't wait to come back again. Highly recommended 🔥"
    },
    {
        "name": "minradi j",
        "review_date": "Mar 2021",
        "title": "High tea",
        "review": "The food was soo yummy. I got a taste of luxury.This place has a very nice ambience with a classy interior. Best place for a peaceful evening. staff is extremley friendly. Highly recommended!!!! 🥺❤️❤️❤️❤️❤️❤️"
    },
    {
        "name": "Sanduni D",
        "review_date": "Mar 2021",
        "title": "High tea",
        "review": "I came here with my bestfriends just to hangout and talk and this was the ideal place to do so. The ambient music was so soothing and let's not forget the food. 5/5 for the food. So many small delicacies presented like little presents to relish while spending time in good company.The staff was really friendly and helpful and I will definitely be coming back. Thank you so much for Sanjiva and the team."
    },
    {
        "name": "Guide340462",
        "review_date": "Mar 2021",
        "title": "Lunch at dining room",
        "review": "We had a lovely lunch at The dining room restaurant with my friends. Superb spread plenty of variety food. Nice presentation. Value for money. Restaurant atmosphere really beautiful. All the staff very helpful especially Amarasinghe & Sumedha keep it up good guys"
    },
    {
        "name": "Sahani1234567890",
        "review_date": "Mar 2021",
        "title": "Sunday Brunch at Lakside",
        "review": "Excellent Service. Good Spread. Wide range of food. Ms. SAMADHI of Dinning room was very helpful. Difinetly we will back again restaurant atmosphere really nice . Thanks to chef Desus & kitchen team. Thank you all"
    },
    {
        "name": "Kumudika B",
        "review_date": "Mar 2021",
        "title": "Over night stay at lakeside",
        "review": "It was a great experience at cinnamon lakeside. Food was fabulous and customer care was excellent. All the staff was helpful and specially samadi and team was very helpful.Hope to visit this vaccinating place again"
    },
    {
        "name": "Amhar A",
        "review_date": "Mar 2021",
        "title": "Superb hotel",
        "review": "We loved cinnamon lakeside Hotel we really enjoyed our stay at the hotel. It was great location. All the hotel staff very helpful. Also our kids really enjoyed. Especially we should mention about our breakfast lovely spread also The Manager Samadhi help us lot... She's outstanding Thank you All hope to visit again & again"
    },
    {
        "name": "Chandima d",
        "review_date": "Mar 2021",
        "title": "High Tea",
        "review": "Excellent service from the Manager Sanjeewa at Lobby Lounge High tea. Food is delicious, enjoyed it.Will definitely come again, an evening we’ll spent. Ordered food and drinks out side the tea menue they were very attentive to make our visit as enjoyable as possible"
    },
    {
        "name": "Malsha",
        "review_date": "Mar 2021",
        "title": "Awesome service !",
        "review": "We had our wedding on 27th January 2021 at the Kings Court, Cinnamon Lakeside and it was super and awesome. We are extremely glad to select Cinnamon Lakeside for our wedding. Mr. Shanaka, Mr.Priyantha and the team gave their fullest support to make our special day a more and more memorable one. All of them were so flexible, friendly, helpful and most importantly easy to work with. They went beyond their limits to offer us the best facilities. Then comes to the delicious food, no much description is needed for their food. And the guests were really happy. After the function we were offered with a lovely suite and it was also really good. Finally, we had an amazing time at Cinnamon Lakeside. Thank you, Cinnamon Lakeside staff, for all the hard work put in and everyone who"
    },
    {
        "name": "Hansani D",
        "review_date": "Mar 2021",
        "title": "High tea",
        "review": "Great place for a reasonable price. Tasty food made my day with a surprise birthday cake dish. 5/5 recommended. Great service from the staff. Food was excellent.great environment as well best high tea ever had in Sri lanka"
    }
]