[
    {
        "name": "Tanya Sundaram",
        "review_date": "May 2021",
        "title": "Excellent location with great staff",
        "review": "I spent 3days in this wonderful nature resort place all by myself. The chef made exactly how I wanted my food. And the senior staff of dining room were very attentive and helpful too. The room was just perfect and the double bed was very comfortable. The staff were very quick in providing what ever I needed while I was in the room too."
    },
    {
        "name": "Kanishk P",
        "review_date": "Apr 2021",
        "title": "Superb Service with the Pandemic situation",
        "review": "Greenery stay with superb service from top to bottom of the staff and food was delicious and very calm full stay with beautiful greenery shades. Rooms were very spacious and super cleaned and sanitized.comfort stay with super covid 19 mitigation plan."
    },
    {
        "name": "Nipunika Fernando",
        "review_date": "Apr 2021",
        "title": "Best place for you next holiday",
        "review": "Highly recommend Amaya Lake for a vacation. We did not travel since covid 19 hit Sri Lanka and we were searching for a better place where all the necessary safety precautions maintain and our main focus was a safe vacation as still covid 19 has not totally eradicated. The safty measures and steps followed by Amaya Lake to ensure guest's safety were upto our esired level. Specially they gives priority to local guests. Staff was very friendly and supportive. Special thanks goes to Sanjeewa who took an extra effort to give the home feeling to us. Chef Alagiyawanna's hospitality and food was unforgettable. Thank you for each and every person at Amaya Lake Dambulla. Above all the natural surrounding of the hotel takes your stress away..."
    },
    {
        "name": "Dinesh Fernando",
        "review_date": "Apr 2021",
        "title": "Genuine Hospitality",
        "review": "Amaya Lake Dambulla is a heavenly place like. A clean & well maintained property with highly motivated staff gives their best out of best. Thanks for Mr. Michael Armstrong - GM & his entire team for the wonderful hospitality offered to me for the little time spent in the property. (Loved the smile🙂 of the Front Office team)"
    },
    {
        "name": "Wskmalik",
        "review_date": "Apr 2021",
        "title": "W.s.k.mallikaaratchi",
        "review": "We had a very pleasant and relaxing time at Amaya Lake. The setting was very peaceful and quiet. The treatment we had at the Ayurvedic SPA, added a very nice dimension to our stay. The welcome we received from Michael and John was very warm and reassuring. On arrival, we were introduced to Head Chef Thushan and his team. This was a nice touch and very comforting. My wife is a vegan and we were able to discuss in detail her meal plans etc. and settle down for our stay. The Team Thusan and Vishudi served an array of superb vegan dishes. The meals were rustic, wholesome, very tasty and had a hometouuch about them. We reckon that Amaya Lake could and should champion itself as being specialist in cateribg for vegetarians and vegans. We personally think that it"
    },
    {
        "name": "Tanya Sundaram",
        "review_date": "May 2021",
        "title": "Excellent location with great staff",
        "review": "I spent 3days in this wonderful nature resort place all by myself. The chef made exactly how I wanted my food. And the senior staff of dining room were very attentive and helpful too. The room was just perfect and the double bed was very comfortable. The staff were very quick in providing what ever I needed while I was in the room too."
    },
    {
        "name": "Kanishk P",
        "review_date": "Apr 2021",
        "title": "Superb Service with the Pandemic situation",
        "review": "Greenery stay with superb service from top to bottom of the staff and food was delicious and very calm full stay with beautiful greenery shades. Rooms were very spacious and super cleaned and sanitized.comfort stay with super covid 19 mitigation plan."
    },
    {
        "name": "Nipunika Fernando",
        "review_date": "Apr 2021",
        "title": "Best place for you next holiday",
        "review": "Highly recommend Amaya Lake for a vacation. We did not travel since covid 19 hit Sri Lanka and we were searching for a better place where all the necessary safety precautions maintain and our main focus was a safe vacation as still covid 19 has not totally eradicated. The safty measures and steps followed by Amaya Lake to ensure guest's safety were upto our esired level. Specially they gives priority to local guests. Staff was very friendly and supportive. Special thanks goes to Sanjeewa who took an extra effort to give the home feeling to us. Chef Alagiyawanna's hospitality and food was unforgettable. Thank you for each and every person at Amaya Lake Dambulla. Above all the natural surrounding of the hotel takes your stress away..."
    },
    {
        "name": "Dinesh Fernando",
        "review_date": "Apr 2021",
        "title": "Genuine Hospitality",
        "review": "Amaya Lake Dambulla is a heavenly place like. A clean & well maintained property with highly motivated staff gives their best out of best. Thanks for Mr. Michael Armstrong - GM & his entire team for the wonderful hospitality offered to me for the little time spent in the property. (Loved the smile🙂 of the Front Office team)"
    },
    {
        "name": "Wskmalik",
        "review_date": "Apr 2021",
        "title": "W.s.k.mallikaaratchi",
        "review": "We had a very pleasant and relaxing time at Amaya Lake. The setting was very peaceful and quiet. The treatment we had at the Ayurvedic SPA, added a very nice dimension to our stay. The welcome we received from Michael and John was very warm and reassuring. On arrival, we were introduced to Head Chef Thushan and his team. This was a nice touch and very comforting. My wife is a vegan and we were able to discuss in detail her meal plans etc. and settle down for our stay. The Team Thusan and Vishudi served an array of superb vegan dishes. The meals were rustic, wholesome, very tasty and had a hometouuch about them. We reckon that Amaya Lake could and should champion itself as being specialist in cateribg for vegetarians and vegans. We personally think that it"
    },
    {
        "name": "nalakayl",
        "review_date": "Apr 2021",
        "title": "Family friends visit..",
        "review": "- Location excellent & relaxed, well maintained , relax your mind -Clean rooms with sufficient space ( family rooms). - Foods average , but taste is quiet good. - Concentration on Covid 19 guidelines are poor. - Over all nice place to visit , specially nature lovers, beautiful green surrounding, nice medicine who having bussy life."
    },
    {
        "name": "Dharshana Wijemanne",
        "review_date": "Apr 2021",
        "title": "Full Two day stay at the hotel",
        "review": "Hi Amaya Lake team This is to convey my special note of appreciation for the great support and hospitality offered by you and your team despite many challenges. Indeed my family and kinds enjoyed a lot during the two full day stay at the hotel.Food is very good. ,Rooms and entire hotel premises maintained well. Look forward to visit again Rgds Dharshana Wijemanne"
    },
    {
        "name": "Inosh Perera",
        "review_date": "Apr 2021",
        "title": "Tasty food and a comfortable stay",
        "review": "Amaya lake is a beautiful hotel at the edge of the kandalama lake. You can catch a boat ride or ride a mountain bike around. One interesting thing is the buggy ride they use to take guest to places around the hotel. You can call and get a buggy ride for free. Rooms were spacious. Food was delicious. Overall a nice experience."
    },
    {
        "name": "Zaroosha",
        "review_date": "Apr 2021",
        "title": "A memorable stay",
        "review": "We had a wonderful stay at Amaya Lake. They have the most hospitable staff compared to any other hotels in Sri Lanka . The food was good. The rooms and the service was were very nice. They were very careful in following the Covid Health protocol at the same time not making it inconvenient for the guests. Overall we had a excellent stay."
    },
    {
        "name": "Udesh",
        "review_date": "Mar 2021",
        "title": "A Place to Relax",
        "review": "The most significant feature we experienced there was the hospitality and the friendly staff. It's a great place to relax, with acres of greenery and the lake. During this pandemic, safety measures are followed to the best, especially in the dining area. Despite being the \"Culture club\", this is the first time we've been to Amaya Lake. Really loved the place then and now. Recommend to anyone!"
    },
    {
        "name": "Shalini De Silva",
        "review_date": "Mar 2021",
        "title": "Best Hotel we ever stayed",
        "review": "Amaya lake is the best hotel we ever stayed. The staff was very friendly, supportive & courteous from the arrival till the departure. We were warmly welcomed by their staff. Every one had a smile on their face from GM to the buggy driver. Food was excellent. Rooms were clean and well maintained. View was breathtaking. Special thanks goes to Mr. Michael ( GM) , John, Thishara, Ranjith , Priya & the rest. It was a very homely stay. We only regret for not staying over for 2 nights. We'll definitely come back again. We recommend Amaya Lake without any doubt . Thank you Shalini De Silva"
    },
    {
        "name": "Subhani",
        "review_date": "Mar 2021",
        "title": "Amaya Lake",
        "review": "It's a great place to stay.Staff were friendly caring & pleasant starting from the reception. Ms.Priyadarshani Thank you for your excellent hospitality. The room was very clean & well organized. Due to Covid 19 pandemic situation health & safety guidelines implemented through out the hotel Very strictly. We would definitely stay there again."
    },
    {
        "name": "hashee",
        "review_date": "Mar 2021",
        "title": "Perfect stay",
        "review": "I visited there with my family & it was a perfect stay check-in & check out was very smooth, room was very good & the food was amazing! Special thanks goes to chef Alagiyawanna, Nashomi, Chameera, Salinda you guys were amazing! Will definitely come back again:)"
    },
    {
        "name": "SANDUN",
        "review_date": "Mar 2021",
        "title": "Unforgettable experience",
        "review": "Calm and quiet place enrich with the beauty of nature. It was Neat and clean surround. Served a great Breakfast, Lunch and Dinner. Had a good Ayurvedic foot therapy from experienced staff. The staff were extremely helpful. Had a brilliant stay.Special Thanks to Priyatharshani who guided us in various helpful ways with good communication.Lahiru and Kushan did their best.Highly recommended. ~Sandun~"
    },
    {
        "name": "Himanshi",
        "review_date": "Mar 2021",
        "title": "A memorable stay at Amaya Lake.",
        "review": "It was a memorable family stay on a weekend for 2-night. The tranquil and splendid sceneries and breathtaking views were impressive. The staff was friendly and so supportive. Priyadharshani was special. Rooms were clean and well maintained. Their adaption to health guidelines was remarkable."
    },
    {
        "name": "zamhar",
        "review_date": "Feb 2021",
        "title": "Good service",
        "review": "Located in one of the peace full Best place to stay and friendly staff excellent food and bed spl thanks for Priyadharshini Ur services also best for customer with smile face I reqmend signature room for couple,,good"
    },
    {
        "name": "Dilantha K",
        "review_date": "Feb 2021",
        "title": "An excellent next to home place specially for a families.",
        "review": "Great hospitality, great food, safe place for everyone who want's to be relaxed with the nature. Full marks for the health and safety team along with their well experienced maintenance & house keeping teams for ensuring every ones health and safety during COVID 19 pandemic time."
    },
    {
        "name": "Kevin D",
        "review_date": "Feb 2021",
        "title": "Birthday Dinner at Amaya Lake",
        "review": "We Had a good time with family in this Fantastic place .. Special Thanks to All the hard working staff who made our night a wonderful one.. \" THUSHARA \" Hotel steward was Very friendly & helpful even the lady who was working at the reception was very helpful & Nice.. Thanks Again It was a memorable one ( 23rd FEB 2021)"
    },
    {
        "name": "Heshan Randika Manikgama Arachchi",
        "review_date": "Feb 2021",
        "title": "Great stay",
        "review": "It was a pleasant stay at Amaya lake with the helpful and friendly staff. Foods were delicious too. we really enjoyed the surrounding. Reasonable price. Have to mention Mr. Jayarathne F&B manager for the friendly service."
    },
    {
        "name": "Sanara De Alwis",
        "review_date": "Feb 2021",
        "title": "Excellent service",
        "review": "We had a stay of 2 nights, full board in the family suite.Starting from the welcome to the end of our stay,the staff was super hospitalable including Nashomi,Eranga,Salinda,Dilanka etc.Highly recommend the staff and the resort including the restaurant staff too.We had a great time and enjoyed very much.Truly appreciate team Amaya Lake with love.Hoping to visit Amaya Lake again with so much of pleasure."
    },
    {
        "name": "Supuni Kannangara",
        "review_date": "Feb 2021",
        "title": "Best service",
        "review": "Hey first of all i have to tell everything is good in this hotel..i didnt find a single fault. There is a girl called eranga she has done her job perfectly . She is so friendly and keeping touch with us everyday before the aarrival too. Nashomi and the front office crew has done a good job. I don't remember the names. Sorry. And dilanka ,kapila( i think his name is kapila he is working for 20 years in this hotel) those two were so good to us. we should talk about restaurant and kitchen staff too. Mr. Jayarathne and prashan were very professional and the crew also very good. Thank you for all the chefs who has done a good job with food. It was amazing . The bakery stuff omg 😍😍 very good. We have booked the signature chalets. Wow beautiful everything is perfect . Thank you so"
    },
    {
        "name": "Chathurika Subhani",
        "review_date": "Feb 2021",
        "title": "A place where never gets enough to be",
        "review": "This place was absolutely amazing, both the mood wise and the surrounding wise. They have the best view all around their premises. I visited to this place for our honeymoon and my birthday with my husband.I have stayed there one day in a garden facing luxury double suit which was all beyond my expectations. From the check-in to the dinning to the departure, the staff was very courteous and was well behaved according to the health guidelines issued under pandemic conditions. All their buffets were great had so many varieties and presented with multiple cuisine experience for only my husband.because I am vegetarian.they had few of vagan items in buffet.But they arrange me eggless cake pieces for my dessert and sorry for bothering you guys for vagan foods.And thank you for the"
    },
    {
        "name": "Prince",
        "review_date": "Jan 2021",
        "title": "Amaya stay",
        "review": "We stayed two nights in the deluxe pool plunged. The stay was most memorable in our life. The cleanliness, service and the surrounding are exceptional but the food was not cooked well and not worth for the money."
    },
    {
        "name": "Stefano S",
        "review_date": "Jan 2021",
        "title": "Quiet and harmony",
        "review": "This resort offers cosy bungalows surrounded by the forest. The rooms are big and well furnished; the level of property is high. You have meals on a patio facing the lake. The buffet offers a big choice of products: local recipes or international meals. All the staff is very friendly. In case of mobility problems, a service of carts is available. We spent some beautiful days in quiet and harmony."
    },
    {
        "name": "Nishan W",
        "review_date": "Jan 2021",
        "title": "Wonderful stay",
        "review": "We spent one night in the hotel. it was a good hotel stay. The staff was so amazing and indeed they gave us a good hospitality. Food was so delicious and restaurant staff was so friendly. I must say that this is a must to go destination."
    },
    {
        "name": "gihan a",
        "review_date": "Jan 2021",
        "title": "Another fabulous weekend getaway ...",
        "review": "A place where never gets enough to be.. Amaya Lake is one of my favorite place to relaxing. As usually I hv started my 2021 travel with Amaya Lake and had the same experience with friendly staff and service. Love nature , lake , walk n surround . I would go there once again soon. Great rooms and foods. ❤️"
    },
    {
        "name": "PaviM",
        "review_date": "Jan 2021",
        "title": "Heaven on earth",
        "review": "We just booked this hotel on last minute and we had a good relaxing stay. Love the relaxing atmosphere. We got Amaya signature suite and it is one of the best rooms which i have stayed so far. cleanliness is top-notch and they really concern about the hygiene. With this Covid situation, no one needs to be worry to go to this property as they strive to sanitize all the rooms and equipment. I should mention about Eranga, Nuwan, Ranjith, Nashomi, Senarathne and the restaurant team as they provided the best service ever. Keep up the good work and will definitely come back again. Thank you Pavithra Mahawatta"
    },
    {
        "name": "Aruna Lakmal",
        "review_date": "Jan 2021",
        "title": "Simply Amazing! Loved the Food!!",
        "review": "I especially wanted to write about this as I had a great experience, not for the first time in this hotel. Last time, it was a great experience and I just wanted visit Amaya Lake again with my entire family. First of all, their COVID safety precautions were outstanding and well organized. I booked two rooms for my family and, I found that we got a double bed with two mattresses and I was a bit of worried about that. Personally, I don't want to have a bed with two mattresses in a hotel and I wanted to change it as soon as possible. I called the operator and they agreed to change the room after the lunch and again they called me and said they can wrap the mattresses as a single bed for us, but I was not so happy with that. However, staff managed to arrange two rooms for us with"
    },
    {
        "name": "Rishitha Nishadh",
        "review_date": "Jan 2021",
        "title": "Had the Best Hospitality in Sri Lanka, Nice Amazing Location",
        "review": "Best Location to stay in Dambulla. We stayed for 2 days and the experience was very amazing. They have a wide variety of foods in the buffet. Wow foods were very delicious. Rooms are very clean and smooth. Surroundings are very beautiful!!! If you are searching for a place to relax, This is the best location you got. Nice hospitality every time we had. Specially beautiful Lady called Nashomi Provide us a great hospitality. Amaya Lake is the best..."
    },
    {
        "name": "prashanthi u",
        "review_date": "Jan 2021",
        "title": "an amazing experience",
        "review": "We had a great time at hotel amaya lake in December.Actually it was a superb location and rooms were well maintained.Food was delicious and the staff was very friendly. We are entirely satisfied with their service."
    },
    {
        "name": "suwanna v",
        "review_date": "Dec 2020",
        "title": "A true model of outstanding hospitality!",
        "review": "Stayed two nights in Amaya Lake and without doubt one of the favorite hotels located in Dambulla. Beyond the relaxing environment of the Hotel, the next best part was the fantastic food and excellent service. The menu has a great variety of food choices and the preparation made for superior tasting. The staff was very attentive, professional and friendly. Without hesitating recommend Amaya Lake to anyone. Kudos."
    },
    {
        "name": "Alex",
        "review_date": "Dec 2020",
        "title": "Relaxing Place",
        "review": "We had an average experience at this hotel. Travelled with my family. The hotel was full on the day we travelled and the restaurant service was a bit slow for my liking,however, the staff tried their best to serve everyone they could."
    },
    {
        "name": "Chathurani K",
        "review_date": "Dec 2020",
        "title": "Had a safe and great holiday",
        "review": "Sevan of our family members including 3 kids were at Amaya Hills and at Amaya Lake on Friday 11th & Saturday 12th December 2020 respectively on HB basis. My 2nd time to the Hills and first time to the Lake. The hotels and the staff were very well prepared for Covid regulations. This was to celebrate my daughters BD and Anil who at Hills had organized it very well. Pools were closed but we enjoyed both places very well. Amaya Lake is a good place for kids who have ample space to play. Nice architecture. All four meals were buffet and those were good but Hills had better variation. Lake was more crowded than the Hills. I had forgotten my specs at Amaya Lake and they couriered it to me. Had a safe and great holiday."
    },
    {
        "name": "Ranahansa Wickramarathne",
        "review_date": "Nov 2020",
        "title": "Good relaxing break!",
        "review": "We stayed at amaya resort and it was great. Location was perfect for everything! Staff was helpful, Friendly. and meals was great. Room was perfect for my daughter, wife and myself. Good relaxing break!. Overall an enjoyable stay. Highly recommended four star resort for family"
    },
    {
        "name": "Bhathiya W",
        "review_date": "Nov 2020",
        "title": "Wedding reception and stay",
        "review": "We had our nuptials and wedding reception at Amaya Lake, Dambulla amidst the Covid19 situation in the country. The staff of Amaya Lake including Mr. Hemantha (F&B manager) took an extra effort to put things in order taking all the safety precautions making sure our guests and their staff are safe. Our guests had a safe and lovely atmosphere throughout the function and food was absolutely delicious! We are so greatfull for the staff of Amaya Lake for helping us to make our day happen. The stay after the wedding was also great!"
    },
    {
        "name": "Eranga",
        "review_date": "Nov 2020",
        "title": "Wedding",
        "review": "To Mr. Hemantha & Team Just a big thank you to you and your team. We had the best day and made so many special memories at your beautiful venue. We hope we get to visit again in the near future to enjoy as a guest!"
    },
    {
        "name": "Tharindu W",
        "review_date": "Oct 2020",
        "title": "Excellent implementation of covid-19 safety system, Excellent Staff, Great Ambience. Would always return",
        "review": "I am a local and was here with my girlfriend to celebrate her birthday on the 24th of October 2020 while the country experienced its second wave of the corona virus. In a time as such, one must particularly appreciate everything the resort did to ensure a safe stay for us, while also ensuring we had a relaxed stay. Dilini from front office at Amaya Lake reached out to us and briefed on the process and declaration forms prior to arrival, and even offered to postpone our reservations in lieu of covid-19 lockdowns that could have potentially happened. Thankfully this didn't bother us. When we were at the hotel, the staff kept social distance, always wore masks and disposable safety gloves at all times, always sanitizing their hands before and after offering anything to us,"
    },
    {
        "name": "Tiasha Fernando",
        "review_date": "Oct 2020",
        "title": "A stay at Amaya Lake",
        "review": "We travelled on days where some areas of the country were under lockdown. It made us rethink whether we should really take a chance and travel to Dambulla. But as soon as we got to the hotel, we truly felt safe, as the staff was well equipped to ensure hygiene practices were in place. Temperatures were checked upon entry to the dining hall and we were also asked to sanitize/ wash our hands. The service staff wore face masks and gloves at all times. Even the pens used for guests, at the reception were sanitized to minimize the risks. Ample sanitizer dispensers were kept in the common areas of the hotel. Even the buggy cart seats, handles etc were santized. The rooms are quite spacious and everything inside the room blends very well with the beautiful surroundings. The rooms"
    },
    {
        "name": "renukaleel",
        "review_date": "Oct 2020",
        "title": "It was an excellent stay, peaceful place to relax, very friendly staff, breathtaking views, good food",
        "review": "It was an excellent stay, peaceful place to relax, very friendly staff, breathtaking views, good food, comfortable rooms in the woods with all the modern facilities A big Thank You & Good Luck for all the Staff!"
    },
    {
        "name": "Asanka Athapattu",
        "review_date": "Oct 2020",
        "title": "Annual Trip of Commercial Leasing Kandy Metro branch",
        "review": "It was an amazing holiday at Amaya Lake with our families. Top class service from hotel staff with friendly, flexible, efficient and quality manner. Place is higer grade with clean,more natural unique environment. Food also at high quality, tasty and many varieties. Got extra mile support to Cricket fun, kids events and music session. Finally special thank must go to the key persons Mr.Hemantha (Asst mgr F&B) Eranga (Reservations) & Nashomi (GRO)"
    },
    {
        "name": "Parakrama J",
        "review_date": "Oct 2020",
        "title": "Relaxing Family Getaway!",
        "review": "The location of the hotel bordering Kandalama Lake is surreal. The atmosphere is calm and quiet. The chalets are located within the woods in a serene setting. The staff were extra courteous, efficient and attended to all our requests, specially when it comes to our 2 yr old daughter's requirements. Food and beverages are well above average. The Spa treatment my wife had got a very positive rating from my wife. All in all, this is a perfect getaway for a quiet and refreshing break from daily hustle and bustle. Highly recommenced! Will definitely visit again!"
    },
    {
        "name": "P Wijayasinghe",
        "review_date": "Oct 2020",
        "title": "A Stay to Remember",
        "review": "A paradise with breathtaking views and delicious food with a wide variety. The beautiful GRO Nashomi was immensely supportive and friendly throughout our stay! And especially the support we recieved in the midnight when my friend got suddenly sick, from Mr. Merril John,the doctor and the rest of the staff was amazing which we would never forget!!! Wish u the best of luck!!!!!!!"
    },
    {
        "name": "Amitha Wijayaratne",
        "review_date": "Sep 2020",
        "title": "Fabulous place to relax",
        "review": "A resort with natural beauty, comprising of chalets. Rooms were comfortable and clean. A quiet and peaceful place to relax. The well maintained huge garden planted with various indigenous trees gave a comfortable shade under which the chalets were located. It extended up to the lake. An early morning walk along the perimeter of the lake was quite refreshing and soothing amidst the cool continuous breeze. All three buffet meals were excellent with a wide selection. Very friendly staff was a notable feature. Check-in was smooth and quick despite covid-19 formalities, handled by Nashomi Guest Relations Officer, who greeted us warmly on our arrival and was very helpful during our stay. Performed her duty excellently."
    },
    {
        "name": "Sameera",
        "review_date": "Sep 2020",
        "title": "Excellent hospitality during this hard time",
        "review": "From the arrival to departure we were treated carefully. The restaurant has a huge spread with good options for Foodie lovers. Specially I want to say that food taste is heaven. Restaurant staff was very prompt in attending to us, I was with two kids below to 5 years, they were very kind mind and smile. Housekeeping services are excellent and prompt. I felt very happy because due to the pandemic situation as a citizen, we are spending a hard and stressful life, as well as hotels have fallen to some extent due to lack of tourism(our hotel industry mainly on top of foreign tourism) and hotels depend on Sri Lankans. Thank you for treating Sri Lankans with a heart. Yes, I have a plan for our next vacation."
    },
    {
        "name": "Udara saranga",
        "review_date": "Sep 2020",
        "title": "🔥",
        "review": "Paradise , love this hotel amazing utilization of the large space Not every five start hotel can offer this kind of luxury and relaxation. night is beautiful 🖤, highly recommend everybody , visit this amazing place"
    },
    {
        "name": "Meth B",
        "review_date": "Sep 2020",
        "title": "Meth",
        "review": "Best practices followed to ensure safety from CORONA pandemic. Warmly welcomed to the hotel even without prior reservations. Well maintained rooms, clean and peaceful atmosphere with great food. Had a wonderful time."
    },
    {
        "name": "Dilakshan Fdo",
        "review_date": "Sep 2020",
        "title": "\"Annual Family Outing at Amaya Lake\"",
        "review": "We were very warmly welcome by Guest Relation Officers', They were helpful. It is a very calm-full location , meals delicious, Rooms Superb condition..., Recommended for any one who searching for Day Outing with fun.."
    },
    {
        "name": "Ruwan H",
        "review_date": "Sep 2020",
        "title": "Brilliant Location",
        "review": "I was there with my family and very warm welcome and they are following strict safety rules. View with the lake was amazing. Friendly staff looking after us very well. Room was bit too small for us so we couldn't stay more than a day."
    },
    {
        "name": "Tharaka",
        "review_date": "Sep 2020",
        "title": "Amaya Lake, Kandalama, Sri Lanka",
        "review": "Had a great day in Amaya Lake, Kandalama, Sri Lanka. Looks amazing and 100% satisfaction about the service. Specially, if you want to do enough activities,it's the place. If you want enough free time, that's the place. You can be there as what you want."
    },
    {
        "name": "Chami",
        "review_date": "Sep 2020",
        "title": "Wonderful stay at a wonderful place",
        "review": "Me and my husband select amaya lake to spend our honeymoon on 3rd september 2020.. We enjoyed our stay as well as the delicious foods... Foods were great and still we can remember the taste of them.. Staff was so friendly from front office to fnb staff.. Rooms was also well maintained. They have a nice location near kandalama lake. They offered us a cake as a surprise.. It was so happy to us as we didn't expect such a thing at that time.. We hope to visit again there as we love that place. cheers"
    },
    {
        "name": "Niranga89",
        "review_date": "Sep 2020",
        "title": "Great Hospitality",
        "review": "Friendly staff with great hospitality,clean and spacious rooms.Greeny environment. The best thing we noticed is exceptional staff service.Food was value for money and appreciate the health guidliness applied in the hotel. The Best hotel in the area."
    },
    {
        "name": "Sasanka Jayakody",
        "review_date": "Sep 2020",
        "title": "Romantic get away destination",
        "review": "I always choose Amaya as my vacation designation and I recently visited Amaya Lake. They provide a wholesome experience with super friendly and kind customer service. The food is rridiculously awesome and locations are breathtakingly scenic. Highly rrecommending to couples who wanna ave a romantic get away."
    },
    {
        "name": "Dinej Chandrasiri",
        "review_date": "Sep 2020",
        "title": "Amaya Lake . A MEMORABLEexperience",
        "review": "It was a great experience here in amaya lake. Beautiful and calm surrounding. Beautifully planned hotel. Of course the staff members are really ready to help us. Specially the front office staff and the pool staff are really good. The meals are tasty although the items are cooperatively less. For me the overall experience is up to the expectations."
    },
    {
        "name": "prabuddha w",
        "review_date": "Sep 2020",
        "title": "Excellent",
        "review": "Fantastic place with nice green environment.view from the room was excellent.delicious buffet.warm welcome and friendly service .very quite and relax environment. Great hotel for nature lovers. we were amazed by everything. Thank u Amaya Lake"
    },
    {
        "name": "Chathuranganie W",
        "review_date": "Sep 2020",
        "title": "Excellent amaya lake",
        "review": "We had a fantastic weekend in amaya lake..fantastic view and superb location.And experienced a superb service from friendy staff..took a fresh breath and rest.will hope visit you again soon.thank you amaya lake.."
    },
    {
        "name": "shamil n",
        "review_date": "Sep 2020",
        "title": "Leisure",
        "review": "Excellent hotel .so much space just to walk around . Excellent bartender named madhushan . Gave me excellent service to me and my family . Must visit place when you visit Dambulla. The best in Dambulla i would say ."
    },
    {
        "name": "Chamila",
        "review_date": "Sep 2020",
        "title": "Visit during Covid",
        "review": "Our second visit to this lovely property. Well maintained environment. Necessary steps being taken to maintain safer environment during this Pandemic. Less number of staff being deployed but they are happily deliver their service towards guests even though bearing heavy load of work. We visited the property during weekdays and number guests were low. All the restaurateur staff were working hard to maintain safety measures as well as they are very friendly and do their best for the guests. Specially want mention Chef Ruwan, who is very keen on guests meals and supports everyone in a joyful manner. Many staff members were covering several roles in a satisfying manner. Recommend this hotel for to relax your self for a while. Thank you !"
    },
    {
        "name": "Rebecca Jayakody",
        "review_date": "Aug 2020",
        "title": "A place I would always return back to💗",
        "review": "Out of all the places I've been to, this will always be somehwere I would love to return back. The place is so beautiful and spacious and when we visited it was so green outside. The chalets we stayed in were super spacious and had all we needed. The pool is fabulous and there is so much space to walk about and get lost in❤️ The lake is in walking distance and there is a tree house and a swing which we enjoyed. The food was amazing and the buffets had a wonderful spread. We loved the ice cream and sausages which were homemade. The staff were the friendliest I've ever come across. There is also a spa which had discounts going on. The environment was so calm and quiet and I wished we could stay there longer."
    },
    {
        "name": "Chulani P",
        "review_date": "Aug 2020",
        "title": "Nice place !!!!",
        "review": "This was my 2nd visit to this place. The first visit was more than 16 years ago then it was named the Culture Club. It is located in a nice place. Passing a lake, beautiful scenery. Nice staff. Need to have a Jim. The food was not tasty at all. Need to have a variety. I think people will not come on a second time if they continue to have this standard of food & beverages. Management should seriously think about this."
    },
    {
        "name": "Zaf",
        "review_date": "Aug 2020",
        "title": "Great value for money with excellent service",
        "review": "Me and my team mates stayed overa night with a planned meeting, they were on the top in terms of Health and safety still they provided us excellent service (top to bottom)...must visit if you go to dambulla"
    },
    {
        "name": "Roshana I",
        "review_date": "Aug 2020",
        "title": "Amaya Lake Dambulla",
        "review": "Had a fantastic stay at amaya lake dambulla in last weekend. Good srvice good foods and fantastic view. Superb eye candy location. Special thanks to Madura at kitchen and all the staff at buffet. Experienced a superb service at buffet from smiling and helping staff. Specially tasty foods. Highly recommended."
    },
    {
        "name": "Ashley F",
        "review_date": "Aug 2020",
        "title": "Superb",
        "review": "The hotel is very concerned on covid19 safety and health regulations. Overall service excellent and we highly recommend for all travellers. Specially thanks F&B manager Mr. Hemantha to provide full support to success our events and visit. This is very safety and memorable place to stay."
    },
    {
        "name": "Madhuka H",
        "review_date": "Aug 2020",
        "title": "Mrs Madhuka Weerasinghe",
        "review": "It was an excellent stay. I loved the lake view front and our kids really enjoyed there. It was so relaxing after a heavy lockdown stay with covid. Staff is very friendly and supportive. Food was delicious.. special thanks to F&B manager Mr. Hemantha and the staff for their extra cautions taken with covid. I can highly recommend this place for anyone who wants a memorable stay..."
    },
    {
        "name": "Nalaka Bandara",
        "review_date": "Aug 2020",
        "title": "Pleasant stay with utmost hospitality",
        "review": "Ideal nature resort to relax & enjoy with ur family. Breathtaking views of the Kandalama Lake & da surroundings made our stay much happier. During our two days stay the staff & the management took a good care of us & specially must thank to the F&B Manager Mr. Hemantha for his devoted hospitality. We felt very safe inside the room, dining areas, walking areas, play areas, the pool & almost everywhere bcos of the health precautions which have taken by the resort at this pandemic situation. Highly recommended this wonderful resort for families with children."
    },
    {
        "name": "Sonali W",
        "review_date": "Aug 2020",
        "title": "Excellent Service",
        "review": "Excellent service overall. The hotel is very concerned on Covid 19 health and safety regulations. Special thanks to deluxan (manager front office) and excellent staff working under him. Recommend for all leisure travelers"
    },
    {
        "name": "Indu Kobe",
        "review_date": "Aug 2020",
        "title": "Lazy long weekends made better at Amaya Lake",
        "review": "Take in a breath of fresh air and ease into rest and relaxation, forgetting that the real world ever existed. Blue skies, fresh green flora around the property, and walkways with hums of nature at any time of the day, are what awaits you at Amaya Lake. With exceptional service from the General Manager and team, including Front Office and F&B in particular, Amaya Lake is the place to go for excellence in all areas of hospitality. The rooms were very clean and comfortable, and the staff follow strict measures to clean and sanitize rooms and public areas. The food was of a high standard and delicious the entire time of our stay, be it breakfast, lunch, dinner or high team. The staff are extremely accommodating and friendly, and willing to go the extra mile to make sure that"
    },
    {
        "name": "Tuan iSmath",
        "review_date": "Aug 2020",
        "title": "We had a fantastic weekend",
        "review": "Dear Management and staff of Amaya Lake, We had a fantastic weekend at your prestigious property. From the time of entry we were greeted with happy staff full of smiles. The room which we stayed was clean and comfortable. All three meals were very tasty and prepared in the highest hygiene standards. We highly enjoyed the excursions which were arranged by the hotel. Special thanks to the staff and ayurvedic doctor at the hotel, who treated my knee injury. I was surprised to see on the next day of my stay, that I was back to my normal self and was able to enjoy the rest of my stay. Thank you for your never ending hospitality. I will definitely stay with you and recommend you to my friends and family. Thank you."
    },
    {
        "name": "Uth Sen",
        "review_date": "Aug 2020",
        "title": "Delicious foods",
        "review": "I would rate excellent for the foods the comfortable room and beauty in location except the terrible experience we got in using the pool. Due to covid they let us use pool for 1h depending on booking the pool at arrival, the pool keeper is so strict whether we come at booking time, despite number of people at pool at that time and the he conveyed that message to us in very unfriendly way. Everything else was smooth.Buffett was rich in different combinations of foods for the 3 meals which we enjoyed a lot. Don't miss to witness the peaceful night sky view at Kandalama lake at hotel premises"
    },
    {
        "name": "SeraG",
        "review_date": "Aug 2020",
        "title": "Amaya Lake – holidays by the lake don’t get better than this!",
        "review": "In a year of so many staycation offers, there is no better way to enjoy a family holiday than to head out of the city to the countryside. One holiday package my family and I really enjoyed was the staycation deal put out by Amaya Hotels and Resorts. With three distinctive hotels offered, Amaya Lake (Dambulla), Amaya Hills (Kandy) and Amaya Beach (Passikudah), and the advantage of staying in one, or in all three, at just Rs.6,900 per person per night, on a twin sharing basis (full board), we decided to avail ourselves of this staycation! Amaya Lake, in the heart of the cultural triangle was our preference. The 50-acre property offers stunning, tranquil lakefront scenery, picturesque views of tree-lined pathways (the magnificent trees are a sight to behold), lush hills, and"
    },
    {
        "name": "Buddhika Jayakody",
        "review_date": "Jul 2020",
        "title": "Holiday with friends",
        "review": "Beautiful and spacious hotel with breathing surroundings. Loved the area near the lake and its ideal for the windown and relaxing. Lodge concept is very well presented. Clean rooms and bathrooms lived up to our expectations. However I was very disappointed over the food arrangements over dinner. While I understand that they may need to reduce options / food varieties as it was offered with discounts but that's not an excuse to offer inedible food. 11th July dinner was hopeless and was not at all tasty. None of us enjoyed it. They could have had few options but food should have been tasty. Crowd management at the entrance could have been managed better as some of the hotel employees were idling while some were trying to manage. Specially during a pandemic situation they should"
    },
    {
        "name": "gihan a",
        "review_date": "Jul 2020",
        "title": "Wonderful Stay ❤️",
        "review": "I have bn looking for a place to spend my weekend and also celebrate my niece's birthday. And it was more than We expected.was a wonderful experience with such a lovely staff,and the beautiful environment. The staff is really support ur in every way. Followed every safety measures and take caring us from check in to check out. I highly recommend this place for anyone who wants to spend their vacation with the loved ones. ❤️"
    },
    {
        "name": "SHEHAN S",
        "review_date": "Jul 2020",
        "title": "Beautiful place with safety first",
        "review": "Very impressed with the safety precautions they had right from the guest arrival. It was good to see every single staff is adhering to the health guidelines. Rooms were well sanitized with all its equipments inside. It was a low occupancy day but still they had a good spread of food. And food was Halal. Resort is at a beautiful location facing the Kandalama lake and ideal for a big family outing too. They have an amazing cricket ground too. Really enjoyed our stay."
    },
    {
        "name": "The Travel Couple - Chathu & Ishanka",
        "review_date": "Jul 2020",
        "title": "Calm and peaceful environment, good value for money",
        "review": "Beautiful hotel with nicely done landscapes bordering the Kandalama lake. Everywhere it’s green and you can have a relaxing stay here. Major highlight is the sunset at kandalama lake front. You can witness plenty of birds here and they have named the rooms after birds as well. Food is good. Service could have been better. They cleared our tables even before we finish our meals at both dinner and breakfast. They re arrange everything but it felt unwelcome. Must specially mention that they have taken this covid situation very seriously and have taken all the possible measures to prevent any exposure to the virus. Overall good value for money."
    },
    {
        "name": "Asanka Adikari",
        "review_date": "Jul 2020",
        "title": "Amazing Experience",
        "review": "Every thing was perfect. Staff was very friendly. Highly recommended. They had planned everything in advance to take prevent the spread of covid-19. Rooms were in excellent condition. Food was great.."
    },
    {
        "name": "Sachini",
        "review_date": "Jul 2020",
        "title": "Fantastic service amidst Covid 19.",
        "review": "Amaya Lake is definitely one of the best hotels in Sri Lanka. What stood out the most during my stay is the friendliness of the staff. The lengths they went into to make the stay comfortable and most definitely memorable. Going above and beyond service and providing a home away from home. Especially all the restaurant staff and Aruna. Considering the fact that the whole family are vegetarians, the lengths they went into to cater to our needs without us requesting was definitely touching. Even the luggage carriers were extremely considerate and friendly. Having been to many hotels in Sri Lanka, it really can be considered one of the top 3 because of the staff alone. Of course, everything else was good too. The cleanliness, the ambience and the food. All in all, Amaya Lake"
    },
    {
        "name": "Iroma W",
        "review_date": "Jul 2020",
        "title": "Amazing experience at Amaya Lake",
        "review": "This is my second visit to Amaya Lake. I love this place. Staff is so helpful and friendly. Also, preparedness and precautions plan against covid 19 is well organized. I felt safe during my stay. Thanks you so much for this amazing hospitality. 👏"
    },
    {
        "name": "Tharindu",
        "review_date": "Jul 2020",
        "title": "Highly recommended",
        "review": "Beautiful view and amazing place. Highly recommended for your stay. Friendly staff and buffet is not available on our stay period but they had good menu to choose. And they gave freedom to ask anything for"
    },
    {
        "name": "Rikaza",
        "review_date": "Jun 2020",
        "title": "Exceptional service during the tough times",
        "review": "Health and safety measures were on point.. Friendly and kind staff made our stay memorable and my kid loved the space available for him for running, riding bikes and the long nature walks. Thank you to the entire staff at Amaya lake,Micheal and the everyone at the restaurant. Will definitely recommend and will come back."
    },
    {
        "name": "Nadisha K",
        "review_date": "Jun 2020",
        "title": "Had a nice time",
        "review": "We had a great time at amaya lake.we got a nice lake view room.good food. Big thank you to mr michael and chef anura lal and thushara from the dining area for the exceptional service and kindness. Hope to visit again soon."
    },
    {
        "name": "Thilangi W",
        "review_date": "Jun 2020",
        "title": "Amazing place",
        "review": "Amazing place, very friendly helpful staff & delicious food. It's the place to relax. They are well maintaining health & safety conditions. Hope to visit again as it was pleasant stay . My kids also enjoyed with nature. Thank you Amaya....💓💓💓💓"
    },
    {
        "name": "pmudawattage",
        "review_date": "Jun 2020",
        "title": "Enjoyable stay",
        "review": "The MOH guidelines are excellently followed in this hotel. It's clean and the staff is friendly. The food was satisfactory. Room number 305 is superb. We can recommend it to anyone who wants a safe holiday."
    },
    {
        "name": "@hj",
        "review_date": "Jun 2020",
        "title": "To unwind from stress",
        "review": "Food : The breakfast and dinner buffet is the one of the best compared to a lot of hotels/ resorts in Sri Lanka , it is not restricted in dishes and quality is good. The best part is the lake with scenic beauty and peaceful environment which is clean to hang around. They sport a good swimming pool. They have a Ayurvedic therapy centre which seemed to be expensive. Staff interaction was minimal and quite professional , nothing commendable about their service tough. The huts provided are good but the lighting is very dull and washroom was not so properly maintained. The location is the best ."
    },
    {
        "name": "Devanmini W",
        "review_date": "Jun 2020",
        "title": "Great stay at Amaya Lake, Dambulla",
        "review": "Visited Amaya Lake, Dambulla on the 22nd of June 2020 after the Corona lock down in the country. Guess it was the best decision we made for a vacation after long stay at home. The measures taken to ensure the safety of the guests from the moment we arrived at the hotel was amazing. We felf so safe as the hygiene measures taken were remarkable and everything was super clean starting from the lobby, restaurants, rooms and the bathrooms. Even though it was after the lock down and managing with less staff, the garden, pools and other areas were maintained so well. Hats off for all the start members for job well done... Thank you for your hospitality and for being true hoteliers even at this difficult time. Hiran, Anjali and Devanmini."
    },
    {
        "name": "Chethanika Devini",
        "review_date": "Jun 2020",
        "title": "Unforgettable Experience",
        "review": "Due to Quarantine situation taken place at the country, we were really stressed out being stuck at home. As the government lifted the travel ban, we wanted to travel somewhere relaxing and calm. We made the right choice by choosing Amaya Lake for our stay. They followed all the safety guidelines during our stay. every morning they checked our temperatures and made sure the guests are well. We were advised to keep social distancing in the buffet area and the staff helped us to choose the meals we wanted. The food was super delicious and they were kind enough to provide some extra meals when we asked. The rooms are super clean and they put a lot of effort to keep the hotel that way with the limited staff. The atmosphere of the hotel is amazing. everywhere you look, you'll see"
    },
    {
        "name": "Mayumi W",
        "review_date": "Jun 2020",
        "title": "Amaya Lake, Dambulla- Best family retreat experience ever",
        "review": "Best villas for families for a serene retreat. Friendly staff and Amazing service. A beautiful ambience so close to nature. Properly maintained land area, perfect for an early morning or an evening stroll for nature lovers"
    },
    {
        "name": "Swarnasinghe",
        "review_date": "Jun 2020",
        "title": "Great Service as always",
        "review": "Even during the pandemic situation we did not have second thoughts to visit Amaya Lake as it never failed to meet our expectations. They have taken all the necessary measures to ensure the guests safety from the entrance to exit which were above and beyond our expectations. Hard working and friendly staff, delicious and filling foods and lush green environment made our stay a memorable one."
    },
    {
        "name": "chapa j",
        "review_date": "Jun 2020",
        "title": "Very ppleasant stay",
        "review": "We had our honeymoon stay here and thanks alot for that remarkable and excellent hospitality.....Lovely,professional and genuine staff,lovely environment.room is perfect and the location is stunning..had a peaceful night.best visit ever...💓"
    },
    {
        "name": "Chami0075",
        "review_date": "Jun 2020",
        "title": "Beautiful hotel and very good service",
        "review": "Rooms, location, pool service all perfect. definitely going back again perfect safety measures taken due to corona virus. Food and drinks service trough restaurant and room services is perfect huge landscape area to relax and cycling"
    },
    {
        "name": "Indika Aluthweediya",
        "review_date": "Jun 2020",
        "title": "LIFE BEGINING",
        "review": "Everything is good- Cleaning, Room service, yummy foods, pool service, internal transport , Room comfortable, Entertaining ,Gaming facilities ............all are excellent, Bird watching, Jogging, feel relaxing in lake front with wind blowing , So what a experience .....We love it"
    },
    {
        "name": "Nelson R",
        "review_date": "Jun 2020",
        "title": "Beautiful!",
        "review": "These folks are on top of the curve with the corona virus prevention and hotel reopening. Painstaking attention to detail, all the while friendly and helpful. Felt safe and at ease. Such a beautiful property. Incredibly beautiful property!"
    },
    {
        "name": "Dinuka Edirisinghe",
        "review_date": "Jun 2020",
        "title": "A safe heaven middle of Corona crisis.",
        "review": "Myself being a doctor who was exausted fighting in the frontline with Corona, went to Amaya lake to celebrate my 1st wedding anniversary. We were the 1st guests there after they reopened following being closed for more than 2months. It was a magical experience for us. The hospitality, comfort was exceptional. How the hotel has managed to preserve the nature was really astonishing. Kandalama lakr which was full due to recent rains along with greeny forest took us to another level of relaxation & the most friendly staff made sure that we enjoyed our best. Along with the GM & department managers (specially Mr.Dilukshan), staff were ready to go an extra mile to serve us which is really appreciated. Most of all, they had the best sanitary practices I have ever seen in an"
    },
    {
        "name": "shaSouthAfrica",
        "review_date": "Apr 2020",
        "title": "Loved this hotel",
        "review": "We would love to stay in this hotel again. The hotel décor is stunning. The location, ambience and forest like setting is nothing short of spectacular. In the evenings we used to walk towards the lake and just sit and admire the surroundings. In the morning we woke up to the soothing sound of birdlife. The pub area has a wonderful atmosphere at night. The supper and breakfast could be improved though. The price of supper at 1300 LKR is steep, and since this hotel is further away from the town, you would have no choice but to eat here."
    },
    {
        "name": "Annabelle A",
        "review_date": "Apr 2020",
        "title": "Lovely hotel, beautiful grounds",
        "review": "Lovely location on the side of the lake and the rooms were detached or semi-detached bungalows. Very spacious rooms and bathrooms and beautifully kept. Food was excellent and nothing was too much trouble. Would heartily recommend this fine hotel"
    },
    {
        "name": "Nim and Kieran",
        "review_date": "Mar 2020",
        "title": "Amazing hotel, amazing service, amazing wedding",
        "review": "We got married at Amaya Lake last month. It was an amazing week and all our guests commented that this was one of the best weddings they had been to, and a major reason for this was the hospitality and attention to detail shown by food and beverages manager Hemantha Rathnayake, and all his staff. The hotel staff prepared special welcomes for both of us and made us feel looked after from day one. We had a number of requests and everyone went out of their way to make sure everything worked well. For example, the bar manager approached me to ask how specifically we would like to make the cocktails and whether we would like any special drinks to be arranged. We had 2 major functions which required lots of organisation- these were handled extremely professionally from the wide"
    },
    {
        "name": "Natalie V",
        "review_date": "Mar 2020",
        "title": "Fantastic hotel",
        "review": "I stayed here as part of a Flashpack group early March for 2 nights. It was a fantastic place, close to Sigiriya and with amazing grounds and views over Kandamala Lake. Staff were all incredibly friendly, nothing was too much trouble. The accommodation is provided in beautiful huts, which are clean, spacious and delightfully cool thanks to the air con. There was a great variety of food for both breakfast and dinner and cater to all tastes. The pool was lovely and warm and the bar in the pool was a lovely place to sit with a drink as the sun went down. I could happily have stayed here longer and if I go back to Sri Lanka will certainly have this place on my “to stay” list again."
    }
]